[
    {
        "name": "Kasel",
        "class": "Warrior",
        "weapon": {
            "name": "The Holy Sword, Aea",
            "description": [
                "Each attack has a 35% chance to dealing 160% of ATK as P.DMG.",
                "Each attack has a 35% chance to dealing 192% of ATK as P.DMG.",
                "Each attack has a 35% chance to dealing 230% of ATK as P.DMG.",
                "Each attack has a 35% chance to dealing 275% of ATK as P.DMG.",
                "Each attack has a 35% chance to dealing 331% of ATK as P.DMG.",
                "Each attack has a 35% chance to dealing 400% of ATK as P.DMG."
            ],
            "introduction": "A legendary Holy Sword given to the world by Lua. This legendary artifact materialized 100 years ago when the Demons invaded the Orbis Continent through the Dimensional Gate. According to the legend, the Hero king Kyle used this sword to pierce the heart of the Dark Lord Angmmund and brought an end to the war. However, the two simply vanished, and only Aea remained."
        },
        "treasure": {
            "name": "Proxy's Insignia",
            "description": [
                "[Proxy of God] Additionally, Dodge Rate is increased by 250, and ATK Spd is increased by 100 for the duration of skill.",
                "[Proxy of God] Additionally, Dodge Rate is increased by 250, and ATK Spd is increased by 120 for the duration of skill.",
                "[Proxy of God] Additionally, Dodge Rate is increased by 250, and ATK Spd is increased by 140 for the duration of skill.",
                "[Proxy of God] Additionally, Dodge Rate is increased by 250, and ATK Spd is increased by 170 for the duration of skill.",
                "[Proxy of God] Additionally, Dodge Rate is increased by 250, and ATK Spd is increased by 210 for the duration of skill.",
                "[Proxy of God] Additionally, Dodge Rate is increased by 250, and ATK Spd is increased by 250 for the duration of skill."
            ],
            "introduction": "A rune that proves that one is an agent of Lua, the Goddess of Light. The Rune of Proxy is an artifact of the Church of Lua, and it's given to the knight who wields the Aea, the Sword of Light. The Rune of Proxy pushes enemies with the power of light and increases ATK and morale."
        },
        "treasure-2": {
            "name": "Emperor's Gauntlet",
            "description": [
                "[Valiant Dash] Increases DMG by 20% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Valiant Dash] Increases DMG by 24% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Valiant Dash] Increases DMG by 29% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Valiant Dash] Increases DMG by 35% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Valiant Dash] Increases DMG by 42% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Valiant Dash] Increases DMG by 50% and reduces Cooldown by 10% upon a Crit Hit."
            ],
            "introduction": "Gauntlet imbued with the blessing of Lua, the Goddess of Light.<br>Gauntlet passed down to the kings of the Orbis Continent. Containts the encouragement of the goddess that allows you to use Valiant Dash towards enemies without any fear."
        },
        "hasProfile": true
    },
    {
        "name": "Roi",
        "class": "Assassin",
        "weapon": {
            "name": "Specter's Breath, Redeal",
            "description": [
                "Each auto attack has a 25% chance of inflicting 1 stack of Bleed, and dealing 50% of ATK as extra DMG.",
                "Each auto attack has a 28% chance of inflicting 1 stack of Bleed, and dealing 60% of ATK as extra DMG.",
                "Each auto attack has a 31% chance of inflicting 1 stack of Bleed, and dealing 72% of ATK as extra DMG.",
                "Each auto attack has a 34% chance of inflicting 1 stack of Bleed, and dealing 86% of ATK as extra DMG.",
                "Each auto attack has a 37% chance of inflicting 1 stack of Bleed, and dealing 103% of ATK as extra DMG.",
                "Each auto attack has a 40% chance of inflicting 1 stack of Bleed, and dealing 125% of ATK as extra DMG."
            ],
            "introduction": "The group of assassins known as the Laughing Mask has been the master of Orvel's underworld for a long time. Only the best assassin of the Laughing Mask is allowed to wield this dreadful pair of daggers. It is said that the wounds inflicted by these daggers never heal, and that their victims inevitably bleed to death. According to the legend, these daggers were made from the Scythe of the Grim Reaper."
        },
        "treasure": {
            "name": "Cracked Mask",
            "description": [
                "[Blade Claw] DMG is increased by 20%, and Upon Crit Hit, mana is recovered by 300.",
                "[Blade Claw] DMG is increased by 24%, and Upon Crit Hit, mana is recovered by 300.",
                "[Blade Claw] DMG is increased by 29%, and Upon Crit Hit, mana is recovered by 300.",
                "[Blade Claw] DMG is increased by 35%, and Upon Crit Hit, mana is recovered by 300.",
                "[Blade Claw] DMG is increased by 42%, and Upon Crit Hit, mana is recovered by 300.",
                "[Blade Claw] DMG is increased by 50%, and Upon Crit Hit, mana is recovered by 300."
            ],
            "introduction": "The mask that Roi destroyed when he left the Laughing Mask assassins. Assassins mercilessly aim for their enemy's vital points, and they wear masks to suppress their emotions when they eliminate their targets. Roi faces the split mask, and goes behind his enemies to kill them with his Blade Claws to protect his friends."
        },
        "treasure-2": {
            "name": "Soma's Hood",
            "description": [
                "[Curtain of Darkness] Increases ATK Boost by 20% and gains CC resist by 400 for the skill's duration.",
                "[Curtain of Darkness] Increases ATK Boost by 24% and gains CC resist by 400 for the skill's duration.",
                "[Curtain of Darkness] Increases ATK Boost by 29% and gains CC resist by 400 for the skill's duration.",
                "[Curtain of Darkness] Increases ATK Boost by 35% and gains CC resist by 400 for the skill's duration.",
                "[Curtain of Darkness] Increases ATK Boost by 42% and gains CC resist by 400 for the skill's duration.",
                "[Curtain of Darkness] Increases ATK Boost by 50% and gains CC resist by 400 for the skill's duration."
            ],
            "introduction": "A dangerous hood made with the secret method of the Laughing Mask.<br>It was made with the legendary soma that is said to provide endless vitality and the secret of the Laughing Mask.<br>Soma's hood increases the morale of an assassin inside the dark curtain, increasing their ATK, and granting dexterity, maximizing P.Dodge."
        },
        "hasProfile": true
    },
    {
        "name": "Cleo",
        "class": "Wizard",
        "weapon": {
            "name": "Primal Flame, Flenos",
            "description": [
                "Embers explode every 4 sec, dealing 80% of ATK as M.DMG to enemies nearby.",
                "Embers explode every 4 sec, dealing 96% of ATK as M.DMG to enemies nearby.",
                "Embers explode every 4 sec, dealing 114% of ATK as M.DMG to enemies nearby.",
                "Embers explode every 4 sec, dealing 138% of ATK as M.DMG to enemies nearby.",
                "Embers explode every 4 sec, dealing 166% of ATK as M.DMG to enemies nearby.",
                "Embers explode every 4 sec, dealing 200% of ATK as M.DMG to enemies nearby."
            ],
            "introduction": "The essence of the First Flame of the world. The Fire Elemental Lord bestowed this beautiful gem to a human who entered into a contract with him. Over the ages, it ended up in the hands of an archmage, who turned it into the core of his staff. later, the archmage presented this staff to his precious disciple."
        },
        "treasure": {
            "name": "Tome of Purgatory",
            "description": [
                "[Fire Rain] DMG is increased by 20%. Upon Crit Hit on enemies with over 5 stacks of Ember, skill cooldown is reduced by 3%.",
                "[Fire Rain] DMG is increased by 24%. Upon Crit Hit on enemies with over 5 stacks of Ember, skill cooldown is reduced by 3%.",
                "[Fire Rain] DMG is increased by 29%. Upon Crit Hit on enemies with over 5 stacks of Ember, skill cooldown is reduced by 3%.",
                "[Fire Rain] DMG is increased by 35%. Upon Crit Hit on enemies with over 5 stacks of Ember, skill cooldown is reduced by 3%.",
                "[Fire Rain] DMG is increased by 42%. Upon Crit Hit on enemies with over 5 stacks of Ember, skill cooldown is reduced by 3%.",
                "[Fire Rain] DMG is increased by 50%. Upon Crit Hit on enemies with over 5 stacks of Ember, skill cooldown is reduced by 3%."
            ],
            "introduction": "A scroll written by a fire sorceress who was known as the Goddess of Fire. A scroll left by the greatest fire Sorceress of Orvelia, Vesta, when she was in the Tower of Sage. It's very powerful, but it also requires a lot of mana. Cleo took the scroll of Burning hell from the Tower of sage, which was considered a forbidden scroll. Now she's using it to enhance her Fire Rain."
        },
        "treasure-2": {
            "name": "Flamel's Elixir",
            "description": [
                "[Fire Ball] Increases DMG by 20% and leaves 5 stacks of Ember on the affected enemy.",
                "[Fire Ball] Increases DMG by 24% and leaves 5 stacks of Ember on the affected enemy.",
                "[Fire Ball] Increases DMG by 29% and leaves 5 stacks of Ember on the affected enemy.",
                "[Fire Ball] Increases DMG by 35% and leaves 5 stacks of Ember on the affected enemy.",
                "[Fire Ball] Increases DMG by 42% and leaves 5 stacks of Ember on the affected enemy.",
                "[Fire Ball] Increases DMG by 50% and leaves 5 stacks of Ember on the affected enemy."
            ],
            "introduction": "An elixir that fire alchemist Flamel created by condensing flame essence.<br>Flamel's flames continue to burn and burn.<br>Every wizard praises him for his flames, and the flame essence that he made with the salamanders from the Dragia Volcano maximizes the effect of Fire Ball."
        },
        "hasProfile": true
    },
    {
        "name": "Frey",
        "class": "Priest",
        "weapon": {
            "name": "God's Authority, Rosmerta",
            "description": [
                "Each auto attack has a 40% chance of healing the ally with the lowest HP by 42% of ATK",
                "Each auto attack has a 40% chance of healing the ally with the lowest HP by 50.4% of ATK",
                "Each auto attack has a 40% chance of healing the ally with the lowest HP by 58.8% of ATK",
                "Each auto attack has a 40% chance of healing the ally with the lowest HP by 71.4% of ATK",
                "Each auto attack has a 40% chance of healing the ally with the lowest HP by 86.1% of ATK",
                "Each auto attack has a 40% chance of healing the ally with the lowest HP by 105% of ATK"
            ],
            "introduction": "The Angels are said to be closer to Lua than any other race. When a high ranking angel dies, the remaining core is transferred to the haven of angels for resurrection. However, one such angel, Rosmerta, bestowed her core to the Church of Lua. This holy staff has been created from the core's divine energy."
        },
        "treasure": {
            "name": "Forgotten Arbiter's Feather",
            "description": [
                "[Heaven's Vengeance] Target takes 20% increased M.DMG for 10 sec, and Blind duration is increased by 1 sec.",
                "[Heaven's Vengeance] Target takes 20% increased M.DMG for 10 sec, and Blind duration is increased by 1.5 sec.",
                "[Heaven's Vengeance] Target takes 20% increased M.DMG for 10 sec, and Blind duration is increased by 2 sec.",
                "[Heaven's Vengeance] Target takes 20% increased M.DMG for 10 sec, and Blind duration is increased by 2.5 sec.",
                "[Heaven's Vengeance] Target takes 20% increased M.DMG for 10 sec, and Blind duration is increased by 3 sec.",
                "[Heaven's Vengeance] Target takes 20% increased M.DMG for 10 sec, and Blind duration is increased by 3.5 sec."
            ],
            "introduction": "Feather from the Guardian of the Sun. Feather of an angel who saved the people by fighting against the demons in the past. He left his feather as proof of his promise to return once again if the world falls into chaos. An artifact of the Church of Lua that summons holy rays of the sun to blind the enemy."
        },
        "treasure-2": {
            "name": "Miraculous Medal",
            "description": [
                "[Blessings of Light] Increases shield amount by 50% and recovers 100 Mana every second for 4 sec.",
                "[Blessings of Light] Increases shield amount by 50% and recovers 120 Mana every second for 4 sec.",
                "[Blessings of Light] Increases shield amount by 50% and recovers 140 Mana every second for 4 sec.",
                "[Blessings of Light] Increases shield amount by 50% and recovers 170 Mana every second for 4 sec.",
                "[Blessings of Light] Increases shield amount by 50% and recovers 210 Mana every second for 4 sec.",
                "[Blessings of Light] Increases shield amount by 50% and recovers 250 Mana every second for 4 sec."
            ],
            "introduction": "Medal made by the saintess of miracles, Yvonne, with the revelation of the goddess.<br>The Medal of Miracles is a sacred artifact that containts the magic of light. It is said that saintess Yvonne saved the city that was invaded by the demons with the blessing of light that was boosted with this medal."
        },
        "hasProfile": true
    },
    {
        "name": "Aisha",
        "class": "Wizard",
        "weapon": {
            "name": "Noble Fate, Mahitra",
            "description": [
                "Each attack has a 35% chance of dealing 40% of ATK as extra M.DMG.",
                "Each attack has a 35% chance of dealing 48% of ATK as extra M.DMG.",
                "Each attack has a 35% chance of dealing 57% of ATK as extra M.DMG.",
                "Each attack has a 35% chance of dealing 69% of ATK as extra M.DMG.",
                "Each attack has a 35% chance of dealing 83% of ATK as extra M.DMG.",
                "Each attack has a 35% chance of dealing 100% of ATK as extra M.DMG."
            ],
            "introduction": "In the Tower of Sage, the title of Purple indicates the pinnacle of mana capacity. Aisha's seemingly endless mana was simply too much for regulars means of output. For this reason, the Von Daphnel family bought out of all the best mana stones they could find, and took them to Annette, the best technomagi in Orvel Castle. Annette gladly agreed to take on this new project. Soon after, she created Mahitra, a beautiful umbrella befitting an aristocratic wizard of noble destiny."
        },
        "treasure": {
            "name": "Ring of Infinite Mana",
            "description": [
                "[Torrential Rainfall] DMG is increased by 50% and upon Crit Hit, recovers 30 mana.",
                "[Torrential Rainfall] DMG is increased by 50% and upon Crit Hit, recovers 36 mana.",
                "[Torrential Rainfall] DMG is increased by 50% and upon Crit Hit, recovers 43 mana.",
                "[Torrential Rainfall] DMG is increased by 50% and upon Crit Hit, recovers 52 mana.",
                "[Torrential Rainfall] DMG is increased by 50% and upon Crit Hit, recovers 62 mana.",
                "[Torrential Rainfall] DMG is increased by 50% and upon Crit Hit, recovers 75 mana."
            ],
            "introduction": "A ring that was given along with the title of Purple from the Tower of Sage. It is an artifact of witch Eucaletus, who lived in the Swamp of Wisdom. The power it displays depends on the owner's ability. For some, it could be a source of unlimited mana. It's perfect for Aisha, who uses powerful magic cannons."
        },
        "treasure-2": {
            "name": "Noble Hand Mirror",
            "description": [
                "[Destruction Ray] Increases DMG by 50% and recovers 500 MP immediately upon use.",
                "[Destruction Ray] Increases DMG by 50% and recovers 600 MP immediately upon use.",
                "[Destruction Ray] Increases DMG by 50% and recovers 720 MP immediately upon use.",
                "[Destruction Ray] Increases DMG by 50% and recovers 860 MP immediately upon use.",
                "[Destruction Ray] Increases DMG by 50% and recovers 1040 MP immediately upon use.",
                "[Destruction Ray] Increases DMG by 50% and recovers 1250 MP immediately upon use."
            ],
            "introduction": "A sacred treasure passed down through generations of the von Daphnel family. It was a shaman tool to save mana in ancient times. After Aisha embedded the Noble Purple gem with her mana, its power came out. Now it shines brilliantly."
        },
        "hasProfile": false
    },
    {
        "name": "Annette",
        "class": "Mechanic",
        "weapon": {
            "name": "Crystallized Technomagic, Rascal",
            "description": [
                "Every 1.5 sec, gains 1 stack of Charge and recovers 1% mana.",
                "Every 1.4 sec, gains 1 stack of Charge and recovers 1% mana.",
                "Every 1.3 sec, gains 1 stack of Charge and recovers 1% mana.",
                "Every 1.1 sec, gains 1 stack of Charge and recovers 1% mana.",
                "Every 0.9 sec, gains 1 stack of Charge and recovers 1% mana.",
                "Every 0.7 sec, gains 1 stack of Charge and recovers 1% mana."
            ],
            "introduction": "The essence of technomagi, created based on Annette's theory. Five of the highest-ranking court of wizards of Orvel have poured their energy into creating this magical being. It has its own will, making it capable of making independent decisions and acting on them. While it shares its mana with Annette, it can also utilize any other available mana nearby. As such, it is the first great milestone in Annette's effort to make magic available to all."
        },
        "treasure": {
            "name": "Code of Annihilation",
            "description": [
                "[Process of Elimination] DMG is increased by 20% and upon ATK, gains 2 stack of Charge. This stack can be gained while in Overcharge state.",
                "[Process of Elimination] DMG is increased by 24% and upon ATK, gains 2 stack of Charge. This stack can be gained while in Overcharge state.",
                "[Process of Elimination] DMG is increased by 29% and upon ATK, gains 2 stack of Charge. This stack can be gained while in Overcharge state.",
                "[Process of Elimination] DMG is increased by 35% and upon ATK, gains 2 stack of Charge. This stack can be gained while in Overcharge state.",
                "[Process of Elimination] DMG is increased by 42% and upon ATK, gains 2 stack of Charge. This stack can be gained while in Overcharge state.",
                "[Process of Elimination] DMG is increased by 50% and upon ATK, gains 2 stack of Charge. This stack can be gained while in Overcharge state."
            ],
            "introduction": "The top secret code of Babel, the secret society of magic engineering. Magic for normal people! The secret society of technomagi, Babel, is an anonymous society that dreams of making magic available to all. They have each provided a technomagical technique as a secret code, and they've only allowed the use of it to those who can decipher it. Annette deciphered a top secret code in 4 minutes and is using it in the annihilation process."
        },
        "treasure-2": {
            "name": "Script of Healing",
            "description": [
                "[Emergency Treatment] Reduces Mana Cost by 1 and increases Heal Rate by 20%.",
                "[Emergency Treatment] Reduces Mana Cost by 1 and increases Heal Rate by 24%.",
                "[Emergency Treatment] Reduces Mana Cost by 1 and increases Heal Rate by 29%.",
                "[Emergency Treatment] Reduces Mana Cost by 1 and increases Heal Rate by 35%.",
                "[Emergency Treatment] Reduces Mana Cost by 1 and increases Heal Rate by 42%.",
                "[Emergency Treatment] Reduces Mana Cost by 1 and increases Heal Rate by 50%."
            ],
            "introduction": "A healing script for emergencies.<br>It's a product of the secret society of magic engineering, Babel's workshop for the month, 'Battles are Self-serve! Winning scripts in Mechanic Script Battles.'<br>Created by Annette, it's a skill that can heal allies just through engineering, without borrowing any healing magic powers."
        },
        "hasProfile": false
    },
    {
        "name": "Arch",
        "class": "Archer",
        "weapon": {
            "name": "Clear Blue Sky, Sherrkyle",
            "description": [
                "Every 10 sec, inflicts a Judgement Sigil upon a random enemy for 15 sec and deals 168% of ATK as M.DMG.",
                "Every 10 sec, inflicts a Judgement Sigil upon a random enemy for 15 sec and deals 201.6% of ATK as M.DMG.",
                "Every 10 sec, inflicts a Judgement Sigil upon a random enemy for 15 sec and deals 241.5% of ATK as M.DMG.",
                "Every 10 sec, inflicts a Judgement Sigil upon a random enemy for 15 sec and deals 289.8% of ATK as M.DMG.",
                "Every 10 sec, inflicts a Judgement Sigil upon a random enemy for 15 sec and deals 348.8% of ATK as M.DMG.",
                "Every 10 sec, inflicts a Judgement Sigil upon a random enemy for 15 sec and deals 420% of ATK as M.DMG."
            ],
            "introduction": "A powerful weapon of light that can take the form of a spear, a dagger, or a bow. One of the divine treasures of the Angels blessed by an archangel. It is said to be capable of incinerating evil. Due to its versatility, it has traditionally been given to the most talented scout. The number of Demons who perished under its light during the war is too high to count."
        },
        "treasure": {
            "name": "Eye of Heaven",
            "description": [
                "[Arbiter] DMG is increased by 20% and all allies' ATK is increased by 30% for the duration of M.Shield.",
                "[Arbiter] DMG is increased by 24% and all allies' ATK is increased by 30% for the duration of M.Shield.",
                "[Arbiter] DMG is increased by 29% and all allies' ATK is increased by 30% for the duration of M.Shield.",
                "[Arbiter] DMG is increased by 35% and all allies' ATK is increased by 30% for the duration of M.Shield.",
                "[Arbiter] DMG is increased by 42% and all allies' ATK is increased by 30% for the duration of M.Shield.",
                "[Arbiter] DMG is increased by 50% and all allies' ATK is increased by 30% for the duration of M.Shield."
            ],
            "introduction": "Angel Arbiter Pilier's soul egg. Pilier was born from Lua's first flame, and is Arch's master. Pilier was the best Angel warrior and was the one to end the war against the Demons. But after using all of his power, he went back to being an Eye of Heaven, which is the soul egg from, and Arch is holding onto his master's soul."
        },
        "treasure-2": {
            "name": "Magic Square of Pursuit",
            "description": [
                "[Purifying Blaze] Reduces Mana Cost by 1 and increases DMG by 20%.",
                "[Purifying Blaze] Reduces Mana Cost by 1 and increases DMG by 24%.",
                "[Purifying Blaze] Reduces Mana Cost by 1 and increases DMG by 29%.",
                "[Purifying Blaze] Reduces Mana Cost by 1 and increases DMG by 35%.",
                "[Purifying Blaze] Reduces Mana Cost by 1 and increases DMG by 42%.",
                "[Purifying Blaze] Reduces Mana Cost by 1 and increases DMG by 50%."
            ],
            "introduction": "Symbol of the Fire Arbiter Army.<br>Symbol of the Fire Arbiter Army that did great things during the war against the Demons. When using the Magic Square of Pursuit that the Light of Goddess Lua has permitted, Arch becomes a merciless arbiter."
        },
        "hasProfile": false
    },
    {
        "name": "Artemia",
        "class": "Wizard",
        "weapon": {
            "name": "Brilliant Praise, Brauxio",
            "description": [
                "Every 15 sec, creates a Shield for 10 sec that blocks DMG proportional to 200% of own ATK, and ATK is increased by 20%. While the Shield is in effect, gains immunity to CC.",
                "Every 15 sec, creates a Shield for 10 sec that blocks DMG proportional to 240% of own ATK, and ATK is increased by 24%. While the Shield is in effect, gains immunity to CC.",
                "Every 15 sec, creates a Shield for 10 sec that blocks DMG proportional to 290% of own ATK, and ATK is increased by 29%. While the Shield is in effect, gains immunity to CC.",
                "Every 15 sec, creates a Shield for 10 sec that blocks DMG proportional to 350% of own ATK, and ATK is increased by 35%. While the Shield is in effect, gains immunity to CC.",
                "Every 15 sec, creates a Shield for 10 sec that blocks DMG proportional to 420% of own ATK, and ATK is increased by 42%. While the Shield is in effect, gains immunity to CC.",
                "Every 15 sec, creates a Shield for 10 sec that blocks DMG proportional to 500% of own ATK, and ATK is increased by 50%. While the Shield is in effect, gains immunity to CC."
            ],
            "introduction": "This sacred treasure of Penteonia is said to have been sent from the Heavens to eradicate the Demons. This light staff, known to respond only to those worthy of sainthood, radiated with splendid light in the hands of the young Artemia, as if to honor the future empress. It calls upon the power of absolute light, unleashing heaven's vengeance upon its enemies while protecting its wielder with divine light."
        },
        "treasure": {
            "name": "Crown of Brilliance",
            "description": [
                "[Light's Judgment] DMG is increased by 20% and upon killing an enemy, recovers 700 mana.",
                "[Light's Judgment] DMG is increased by 24% and upon killing an enemy, recovers 700 mana.",
                "[Light's Judgment] DMG is increased by 29% and upon killing an enemy, recovers 700 mana.",
                "[Light's Judgment] DMG is increased by 35% and upon killing an enemy, recovers 700 mana.",
                "[Light's Judgment] DMG is increased by 42% and upon killing an enemy, recovers 700 mana.",
                "[Light's Judgment] DMG is increased by 50% and upon killing an enemy, recovers 700 mana."
            ],
            "introduction": "A crown that is passed down to the king of Penteonia. A part of it had been broken by a previous tyrant, but it's been repaired. A new red gem called the Soul of the Sun has been embedded at the center of the crown. Its dignified form compels one to kneel before it in a show of respect."
        },
        "treasure-2": {
            "name": "Queen's Pride",
            "description": [
                "[Critical Intensity] Gains Immunity to CC and increases DMG by 20%.",
                "[Critical Intensity] Gains Immunity to CC and increases DMG by 24%.",
                "[Critical Intensity] Gains Immunity to CC and increases DMG by 29%.",
                "[Critical Intensity] Gains Immunity to CC and increases DMG by 35%.",
                "[Critical Intensity] Gains Immunity to CC and increases DMG by 42%.",
                "[Critical Intensity] Gains Immunity to CC and increases DMG by 50%."
            ],
            "introduction": "Earrings made from light kveril, a rare mineral that is said to only come out in Penteonia. When Artemia was crowned Empress, she received it along with the crown. It doesn't lose its light even at night, and it actually shines even more brightly in the dark. It's known as the jewel of principles and brilliance amongst the people.<br>An item that raises the dignity of the queen as they shine from her ears."
        },
        "hasProfile": false
    },
    {
        "name": "Aselica",
        "class": "Knight",
        "weapon": {
            "name": "Solar Halo, Ignisius",
            "description": [
                "When a normal attack hits the enemy 5 times, the target takes 20% more M.DMG for 10 seconds and is stunned for 0.5 seconds.",
                "When a normal attack hits the enemy 5 times, the target takes 24% more M.DMG for 10 seconds and is stunned for 0.5 seconds.",
                "When a normal attack hits the enemy 5 times, the target takes 29% more M.DMG for 10 seconds and is stunned for 0.5 seconds.",
                "When a normal attack hits the enemy 5 times, the target takes 35% more M.DMG for 10 seconds and is stunned for 0.5 seconds.",
                "When a normal attack hits the enemy 5 times, the target takes 42% more M.DMG for 10 seconds and is stunned for 0.5 seconds.",
                "When a normal attack hits the enemy 5 times, the target takes 50% more M.DMG for 10 seconds and is stunned for 0.5 seconds."
            ],
            "introduction": "Legends speak of a mysterious metal, gold as the glorious rays of the sun, blue as the pure sky, and white as the blinding light. This holy sword and shield set has been forged from that special metal that only Angels can handle. These are divine relics of protection, created to banish the darkness and fill the world with light. Bestowed only to the most righteous Guardian Knight of the Angels, these relics can instantly incinerate any Demon that faces their light."
        },
        "treasure": {
            "name": "Guardian's Trumpet",
            "description": [
                "[Judgment of the Sun] Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 20%.",
                "[Judgment of the Sun] Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 24%.",
                "[Judgment of the Sun] Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 29%.",
                "[Judgment of the Sun] Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 35%.",
                "[Judgment of the Sun] Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 42%.",
                "[Judgment of the Sun] Gains Immunity to CC while in use, and increases P.DEF Boost and M.DEF Reduction by 50%."
            ],
            "introduction": "The trumpet that is said to be blown by the leader of the Archangels when the catastrophe that will end the Material World arrives. It is said that once the guardians hear the sound of the trumpet, they wake up and come down to protect this land."
        },
        "treasure-2": {
            "name": "Bracelet of the Sun",
            "description": [
                "[Blessing of the Sun] Reduces Mana Cost by 1 and increases P.Weakness of the target by 10% for 10 sec.",
                "[Blessing of the Sun] Reduces Mana Cost by 1 and increases P.Weakness of the target by 12% for 10 sec.",
                "[Blessing of the Sun] Reduces Mana Cost by 1 and increases P.Weakness of the target by 14% for 10 sec.",
                "[Blessing of the Sun] Reduces Mana Cost by 1 and increases P.Weakness of the target by 17% for 10 sec.",
                "[Blessing of the Sun] Reduces Mana Cost by 1 and increases P.Weakness of the target by 21% for 10 sec.",
                "[Blessing of the Sun] Reduces Mana Cost by 1 and increases P.Weakness of the target by 25% for 10 sec."
            ],
            "introduction": "Bracelet made by the Archangels to protect the Angels when they descend down to the earth. It contains the sun, so its shines brilliantly.<br>When the angels feel fear, it is said that the sunlight from the bracelet protects their souls. And the fates of the angels are intertwined in the bracelet, so when they feel like their lives are threatened, they can feel each other's pain instinctively."
        },
        "hasProfile": false
    },
    {
        "name": "Baudouin",
        "class": "Priest",
        "weapon": {
            "name": "God's Book, Genesis",
            "description": [
                "Every 30 sec, for 10 sec, a random ally's ATK is increased by 40%, and Crit Chance, ATK Spd is increased by 400.",
                "Every 30 sec, for 10 sec, a random ally's ATK is increased by 48%, and Crit Chance, ATK Spd is increased by 480.",
                "Every 30 sec, for 10 sec, a random ally's ATK is increased by 57%, and Crit Chance, ATK Spd is increased by 570.",
                "Every 30 sec, for 10 sec, a random ally's ATK is increased by 69%, and Crit Chance, ATK Spd is increased by 690.",
                "Every 30 sec, for 10 sec, a random ally's ATK is increased by 83%, and Crit Chance, ATK Spd is increased by 830.",
                "Every 30 sec, for 10 sec, a random ally's ATK is increased by 100%, and Crit Chance, ATK Spd is increased by 1000."
            ],
            "introduction": "Even among the holy relics bestowed to the high priests of the Church of Lua, the God's Book Genesis is special. According to the legend, this book, guarded throughout the ages by the Grand Priests of the church, was written by Lua herself, Iris, the current Grand Priest, upon receiving revelation regarding Baudouin, entrusted this book to his step father, Berman. Later, the book was given to Baudouin when he became a high priest. It is said that this divine relic provides infinite holy energy to its owner, along with the power to unlock the true potential of those who have faith."
        },
        "treasure": {
            "name": "Well-Worn Rosary",
            "description": [
                "[Holy Sanctuary] ATK is increased by 25% for the duration of skill, and recovers 120 Mana per sec.",
                "[Holy Sanctuary] ATK is increased by 25% for the duration of skill, and recovers 140 Mana per sec.",
                "[Holy Sanctuary] ATK is increased by 25% for the duration of skill, and recovers 170 Mana per sec.",
                "[Holy Sanctuary] ATK is increased by 25% for the duration of skill, and recovers 200 Mana per sec.",
                "[Holy Sanctuary] ATK is increased by 25% for the duration of skill, and recovers 250 Mana per sec.",
                "[Holy Sanctuary] ATK is increased by 25% for the duration of skill, and recovers 300 Mana per sec."
            ],
            "introduction": "The rosary that holy priest Evelyn of the Church of Lua carried until her death. It's as if Lua's holy voice can be heard from the rosary, praying that the world won't collapse. The undeniable holy energy engulfs the body, and it maximizes Baudouin's power."
        },
        "treasure-2": {
            "name": "Last Chapter of the Bible",
            "description": [
                "[Spear of Light] Gains Immunity to CC for the skill's duration and increases M.Weakness of the target by 10% for 10 sec.",
                "[Spear of Light] Gains Immunity to CC for the skill's duration and increases M.Weakness of the target by 12% for 10 sec.",
                "[Spear of Light] Gains Immunity to CC for the skill's duration and increases M.Weakness of the target by 14% for 10 sec.",
                "[Spear of Light] Gains Immunity to CC for the skill's duration and increases M.Weakness of the target by 17% for 10 sec.",
                "[Spear of Light] Gains Immunity to CC for the skill's duration and increases M.Weakness of the target by 21% for 10 sec.",
                "[Spear of Light] Gains Immunity to CC for the skill's duration and increases M.Weakness of the target by 25% for 10 sec."
            ],
            "introduction": "The last chapter of the legend that was too horrifying and terrifying to put in the Bible. It talks about the holy light that kills the darkest enemy in the world."
        },
        "hasProfile": false
    },
    {
        "name": "Cassandra",
        "class": "Priest",
        "weapon": {
            "name": "Aurelian Whisper, Goldbreeze",
            "description": [
                "Every 15 sec, heals an ally with the lowest HP by 200% of ATK and dispels all negative effects.",
                "Every 14 sec, heals an ally with the lowest HP by 240% of ATK and dispels all negative effects.",
                "Every 12.5 sec, heals an ally with the lowest HP by 290% of ATK and dispels all negative effects.",
                "Every 11 sec, heals an ally with the lowest HP by 350% of ATK and dispels all negative effects.",
                "Every 9.5 sec, heals an ally with the lowest HP by 420% of ATK and dispels all negative effects.",
                "Every 8 sec, heals an ally with the lowest HP by 500% of ATK and dispels all negative effects."
            ],
            "introduction": "Cassandra works double as an arms dealer. One day, a stolen item came into her possession which immediately caught her attention. It was a beautiful fan adorned with gold decorations and precious gems. According to the rumors, every single lady who possessed this fan soon fell into great misfortune. It has been circulating the market as a cursed item. As soon as she bought it, Cassandra began investigating its origin. As it turned out, this fan, named Goldbreeze, had been created to serve as a concealed weapon. It shouldn't be too hard to guess as to what kind of misfortune the unaware owners of this fan might have suffered."
        },
        "treasure": {
            "name": "Golden Fragrance",
            "description": [
                "[Tempting Wave] Skill cooldown is reduced by 30% and Charm duration is increased by 1 sec.",
                "[Tempting Wave] Skill cooldown is reduced by 30% and Charm duration is increased by 1.5 sec.",
                "[Tempting Wave] Skill cooldown is reduced by 30% and Charm duration is increased by 2 sec.",
                "[Tempting Wave] Skill cooldown is reduced by 30% and Charm duration is increased by 2.5 sec.",
                "[Tempting Wave] Skill cooldown is reduced by 30% and Charm duration is increased by 3 sec.",
                "[Tempting Wave] Skill cooldown is reduced by 30% and Charm duration is increased by 3.5 sec."
            ],
            "introduction": "A legendary gold flame necklace pendant. The legendary Gold King made this gold flame necklace pendant to get the attention of the Goddess of Love and Beauty. Its gold scent creates a Tempting Wave that makes anyone join their side and be loved by every by everyone."
        },
        "treasure-2": {
            "name": "Fancy Ornament",
            "description": [
                "[Fiercely!] Increases duration by 5 sec and additionally increases Crit DMG by 20%.",
                "[Fiercely!] Increases duration by 5 sec and additionally increases Crit DMG by 24%.",
                "[Fiercely!] Increases duration by 5 sec and additionally increases Crit DMG by 29%.",
                "[Fiercely!] Increases duration by 5 sec and additionally increases Crit DMG by 35%.",
                "[Fiercely!] Increases duration by 5 sec and additionally increases Crit DMG by 42%.",
                "[Fiercely!] Increases duration by 5 sec and additionally increases Crit DMG by 50%."
            ],
            "introduction": "A luxurious accessory made by the greatest jeweler in the continent.<br>A limited edition ornament created by jeweler Larik. Any person in high society on the Orbis Continent would love to have one.<br>His work is said to be the epitome of art, and it is said to heal and grant courage.<br>There are only 3 of the limited edition Fancy Ornaments, and one of them obviously belongs to the master of the Gold Bar."
        },
        "hasProfile": false
    },
    {
        "name": "Clause",
        "class": "Knight",
        "weapon": {
            "name": "The Guardian, Exian",
            "description": [
                "When HP falls below 35%, all allies' P.DMG Reduction is increased by 200 and ATK is increased by 100% of P.DEF. Gains CC immunity.",
                "When HP falls below 35%, all allies' P.DMG Reduction is increased by 240 and ATK is increased by 120% of P.DEF. Gains CC immunity.",
                "When HP falls below 35%, all allies' P.DMG Reduction is increased by 280 and ATK is increased by 144% of P.DEF. Gains CC immunity.",
                "When HP falls below 35%, all allies' P.DMG Reduction is increased by 340 and ATK is increased by 173% of P.DEF. Gains CC immunity.",
                "When HP falls below 35%, all allies' P.DMG Reduction is increased by 410 and ATK is increased by 207% of P.DEF. Gains CC immunity.",
                "When HP falls below 35%, all allies' P.DMG Reduction is increased by 500 and ATK is increased by 250% of P.DEF. Gains CC immunity."
            ],
            "introduction": "A sword and shield set engraved with various Runes and infused with ancient magic. These legendary items are said to have been created eons ago by an ancient dragon named Exian, using its own scales. As one of the royal treasures of Orvel, the sword is bestowed only to the knight of the most honorable principles. Its wielder shall serve as the defender of the kingdom and its people, and the protector of life."
        },
        "treasure": {
            "name": "Guardian Knight Insignia",
            "description": [
                "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 20%.",
                "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 24%.",
                "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 29%.",
                "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 35%.",
                "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 42%.",
                "[Guardian Shield] Upon activation, removes negative effects on self, and DEF boost is increased by 50%."
            ],
            "introduction": "Rune of the Orvel Guardian Knights. A Gold lion Rune that is given to knights when they first join the Guardian knights, along with the vow that they will give their lives to protect the kingdom. The rune from the Guardian Knights bolsters a knight's iron will and loyalty, increasing the effectiveness of the Guardian Shield."
        },
        "treasure-2": {
            "name": "Firm Determination",
            "description": [
                "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 100 for 10 sec.",
                "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 120 for 10 sec.",
                "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 140 for 10 sec.",
                "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 170 for 10 sec.",
                "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 210 for 10 sec.",
                "[Shield Strike] Reduces P.Crit Resistance of the affected enemy by 500 and Crit Chance by 250 for 10 sec."
            ],
            "introduction": "Old wooden shield of the knight of the Iron Wall.<br>It's a precious shield that Clause used when he first started training. He has since engraved the name of his deceased comrades in order to remember his determination as a guardian knight.<br>Each time he pushes away enemies with the shield, the knight's firm determination helps him tap into power beyong his limits."
        },
        "hasProfile": false
    },
    {
        "name": "Demia",
        "class": "Knight",
        "weapon": {
            "name": "The Blue Light, Arpheus",
            "description": [
                "Each block has a 10% chance of recovering 3% of mana and reducing all skill cooldown by 1 sec.",
                "Each block has a 13% chance of recovering 3% of mana and reducing all skill cooldown by 1 sec.",
                "Each block has a 16% chance of recovering 3% of mana and reducing all skill cooldown by 1 sec.",
                "Each block has a 19% chance of recovering 3% of mana and reducing all skill cooldown by 1 sec.",
                "Each block has a 22% chance of recovering 3% of mana and reducing all skill cooldown by 1 sec.",
                "Each block has a 25% chance of recovering 3% of mana and reducing all skill cooldown by 1 sec."
            ],
            "introduction": "One day, a vein exuding powerful mana was discovered in the territory of Ziltrion. While investigating, Demia found a blue ore, the likes of which she had never seen before. Numerous wizards and alchemists studied this mysterious ore with the characteristics of both gem and metal, but no one could figure out its identity. Jin, the blacksmith, however, had a different idea. As soon as he saw the ore, he offered Demia to craft powerful gears out of it, with a big smile on his face. With it, he forged a lance and a shield, glowing blue with mana and tougher than a diamond."
        },
        "treasure": {
            "name": "Aura of Protection",
            "description": [
                "[Steel Fortress] Mana cost is reduced by 1 and jump attack's Stun duration is increased by 1 sec.",
                "[Steel Fortress] Mana cost is reduced by 1 and jump attack's Stun duration is increased by 1.5 sec.",
                "[Steel Fortress] Mana cost is reduced by 1 and jump attack's Stun duration is increased by 2 sec.",
                "[Steel Fortress] Mana cost is reduced by 1 and jump attack's Stun duration is increased by 2.5 sec.",
                "[Steel Fortress] Mana cost is reduced by 1 and jump attack's Stun duration is increased by 3 sec.",
                "[Steel Fortress] Mana cost is reduced by 1 and jump attack's Stun duration is increased by 3.5 sec."
            ],
            "introduction": "A stone known to protect one's soul from being absorbed by evil. It only shines for a while at dawn, so it's hard to find. One day, when Demia was fired from battle, a comrade put this in her hands. Even though its a comrade that she can't ever see again...Demia always takes this stone when going out to the battlefield. She does her best to uphold her to to never let the sacrifices of her comrades be in vain."
        },
        "treasure-2": {
            "name": "Shield of Resolution",
            "description": [
                "[Will to Win] Increases DMG by 50% and P.Weakness of the target by 10% for 10 sec.",
                "[Will to Win] Increases DMG by 50% and P.Weakness of the target by 12% for 10 sec.",
                "[Will to Win] Increases DMG by 50% and P.Weakness of the target by 14% for 10 sec.",
                "[Will to Win] Increases DMG by 50% and P.Weakness of the target by 17% for 10 sec.",
                "[Will to Win] Increases DMG by 50% and P.Weakness of the target by 21% for 10 sec.",
                "[Will to Win] Increases DMG by 50% and P.Weakness of the target by 25% for 10 sec."
            ],
            "introduction": "A wooden shield that Demia used as a child for practice. It's been used over a thousand times and is very worn out.<br>Demia uses it to regain her composure when she feels like she has hit a limit.<br>Her pride as a knight of Orvelia resurfaces when she sees this old, worn-out shield."
        },
        "hasProfile": false
    },
    {
        "name": "Dimael",
        "class": "Archer",
        "weapon": {
            "name": "Tears of the Moon, Nerius",
            "description": [
                "Each attack has a 10% chance of dealing 100% of ATK as M.DMG, and all skill cooldown is reduced by 10%.",
                "Each attack has a 12% chance of dealing 120% of ATK as M.DMG, and all skill cooldown is reduced by 10%.",
                "Each attack has a 14% chance of dealing 140% of ATK as M.DMG, and all skill cooldown is reduced by 10%.",
                "Each attack has a 17% chance of dealing 170% of ATK as M.DMG, and all skill cooldown is reduced by 10%.",
                "Each attack has a 20% chance of dealing 200% of ATK as M.DMG, and all skill cooldown is reduced by 10%.",
                "Each attack has a 25% chance of dealing 250% of ATK as M.DMG, and all skill cooldown is reduced by 10%."
            ],
            "introduction": "A treasure of the Dark Elves created using a powerful moonlight stone from Arrovina and a moon tree branch of the highest quality. Nerius is a perfect medium for Moonlight magic, and it is one of the most powerful magic weapons if the Dark Elves. However, it is said that the beautiful silver light of the moon can easily be tainted by darkness. A sublime love has turned into deep darkness, and the dark elf longing for vengeance has fused that darkness into this weapon."
        },
        "treasure": {
            "name": "Eye of Shadows",
            "description": [
                "[Shadow Wave] DMG is increased by 50% and Blind duration is increased by 2 sec.",
                "[Shadow Wave] DMG is increased by 50% and Blind duration is increased by 2.5 sec.",
                "[Shadow Wave] DMG is increased by 50% and Blind duration is increased by 3 sec.",
                "[Shadow Wave] DMG is increased by 50% and Blind duration is increased by 3.5 sec.",
                "[Shadow Wave] DMG is increased by 50% and Blind duration is increased by 4 sec.",
                "[Shadow Wave] DMG is increased by 50% and Blind duration is increased by 4.5 sec."
            ],
            "introduction": "Tear fragments of the beast Heltanios, who lived at the bottom of the Fountain of Life. It spews out pitch darkness, and those who see its eyes end up having their souls stolen by the powerful dark energy. Those who become the master of these eyes will obtain great power and insight. When Dimael was captured in Aegina and was at the brink of death, Maria embedded these eye fragments."
        },
        "treasure-2": {
            "name": "Unbreakable Bracelet",
            "description": [
                "[Black Shackle] Increases DMG by 50% and increases M.Weakness of the target by 10% for 10 sec.",
                "[Black Shackle] Increases DMG by 50% and increases M.Weakness of the target by 12% for 10 sec.",
                "[Black Shackle] Increases DMG by 50% and increases M.Weakness of the target by 14% for 10 sec.",
                "[Black Shackle] Increases DMG by 50% and increases M.Weakness of the target by 17% for 10 sec.",
                "[Black Shackle] Increases DMG by 50% and increases M.Weakness of the target by 21% for 10 sec.",
                "[Black Shackle] Increases DMG by 50% and increases M.Weakness of the target by 25% for 10 sec."
            ],
            "introduction": "A bracelet that was shared with Epigael a long time ago. It has shadow morion hanging, which is a precious jewel amongst the Dark Elves. It is said that those who cut off the shadow morion and will have a thread of their souls, which will lead them to meet again in the next life."
        },
        "hasProfile": false
    },
    {
        "name": "Epis",
        "class": "Assassin",
        "weapon": {
            "name": "The Seductress, Guillotine",
            "description": [
                "Upon attacking, there is a 25% chance of dealing 80% of ATK as extra M.DMG, and ATK being increased by 2%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 96% of ATK as extra M.DMG, and ATK being increased by 2.4%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 115% of ATK as extra M.DMG, and ATK being increased by 2.9%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 138% of ATK as extra M.DMG, and ATK being increased by 3.5%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 165% of ATK as extra M.DMG, and ATK being increased by 4.2%. ATK boost can be stacked up to 10 times max.",
                "Upon attacking, there is a 25% chance of dealing 200% of ATK as extra M.DMG, and ATK being increased by 5%. ATK boost can be stacked up to 10 times max."
            ],
            "introduction": "A deadly scythe that matches the characters of its wielder, Epis. It reaps the souls of those who approach it to admire its beauty. Created from within Epis's own body, the weapon is much like a succubus itself. It delivers extreme pleasure to its victims before absorbing their life energy. It seems that, in a way, Epis tried to show some sort of kindness with this weapon."
        },
        "treasure": {
            "name": "Seductress Shoes",
            "description": [
                "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 20%.",
                "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 24%.",
                "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 29%.",
                "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 35%.",
                "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 42%.",
                "[Devil's Prom] Mana cost is reduced by 1, and DMG is increased by 50%."
            ],
            "introduction": "Epis's treasured item. When Epis first arrived in the human world, she really got into human culture and attended a masquerade. The dancing of a girl wearing red heels caught her eye, and she made a deal with her in exchange for those shoes. Epis wears her seductive heels and gets carried away when inflicting pain on her enemies with her dance."
        },
        "treasure-2": {
            "name": "Succubus's Box",
            "description": [
                "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 2 sec.",
                "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 2.4 sec.",
                "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 2.9 sec.",
                "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 3.5 sec.",
                "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 4.2 sec.",
                "[Nightmare] Increases DMG by 50% and stuns the affected enemy for 5 sec."
            ],
            "introduction": "Box containing the Nightmare Queen's sand of sleep.<br>A box from the Demon World that contains magic sand that causes one to fall asleep. When the enemy falls asleep, attacks the enemy and deals M.DMG through a nightmare that cannot be dispelled."
        },
        "hasProfile": false
    },
    {
        "name": "Fluss",
        "class": "Assassin",
        "weapon": {
            "name": "Twinswords of Fury, Veralta",
            "description": [
                "Every 7 sec, for 30 sec, ATK is increased by 12% and ATK Spd is increased by 120. Can be stacked up to 3 times max.",
                "Every 7 sec, for 30 sec, ATK is increased by 14% and ATK Spd is increased by 140. Can be stacked up to 3 times max.",
                "Every 7 sec, for 30 sec, ATK is increased by 17% and ATK Spd is increased by 170. Can be stacked up to 3 times max.",
                "Every 7 sec, for 30 sec, ATK is increased by 20% and ATK Spd is increased by 200. Can be stacked up to 3 times max.",
                "Every 7 sec, for 30 sec, ATK is increased by 25% and ATK Spd is increased by 250. Can be stacked up to 3 times max.",
                "Every 7 sec, for 30 sec, ATK is increased by 30% and ATK Spd is increased by 300. Can be stacked up to 3 times max."
            ],
            "introduction": "A set of enchanted weapons bestowed upon Fluss's grandfather, a knight hailing from the Republic of Grey, and passed down as family treasures. They are capable of gradually enhancing the physical abilities of their wielder, allowing him to break the boundaries of human limitations and gain supernatural power and speed. Because the effect is gradual, there is no sudden stress to the wielder's body. Each piece is called Blood and Rose, respectively. The names originated from the swirl of blood splatter and flower petals that follow whenever Fluss swings these twin swords. No other warrior has been able to utilize their potential as Fluss does."
        },
        "treasure": {
            "name": "Immortal Rose",
            "description": [
                "[Bloody Petals] DMG is increased by 20% and dodges all M.ATK during the duration of skill.",
                "[Bloody Petals] DMG is increased by 24% and dodges all M.ATK during the duration of skill.",
                "[Bloody Petals] DMG is increased by 29% and dodges all M.ATK during the duration of skill.",
                "[Bloody Petals] DMG is increased by 35% and dodges all M.ATK during the duration of skill.",
                "[Bloody Petals] DMG is increased by 42% and dodges all M.ATK during the duration of skill.",
                "[Bloody Petals] DMG is increased by 50% and dodges all M.ATK during the duration of skill."
            ],
            "introduction": "A rose that will never wither, even if it's been picked. It's a flower that Fluss loves. It reminds Fluss about the duty of a knight, which is the basis for his strong will that allows him to be confident in battle."
        },
        "treasure-2": {
            "name": "Tempting Perfume",
            "description": [
                "[Flashstep] Changes the Mark irremovable and increases ATK by 20% for 10 sec once the enemy with the mark is killed.",
                "[Flashstep] Changes the Mark irremovable and increases ATK by 24% for 10 sec once the enemy with the mark is killed.",
                "[Flashstep] Changes the Mark irremovable and increases ATK by 29% for 10 sec once the enemy with the mark is killed.",
                "[Flashstep] Changes the Mark irremovable and increases ATK by 35% for 10 sec once the enemy with the mark is killed.",
                "[Flashstep] Changes the Mark irremovable and increases ATK by 42% for 10 sec once the enemy with the mark is killed.",
                "[Flashstep] Changes the Mark irremovable and increases ATK by 50% for 10 sec once the enemy with the mark is killed."
            ],
            "introduction": "Perfume containing the first Vivienne roses of the year. Vivienne roses are beautifull but deadly. Those affected by the smell will hallucinate and just stare in awe as their opponent moves."
        },
        "hasProfile": false
    },
    {
        "name": "Gau",
        "class": "Warrior",
        "weapon": {
            "name": "Holy Bird, Numinu",
            "description": [
                "Per every 1% of HP lost, ATK is increased by 0.8% and ATK Spd is increased by 8.",
                "Per every 1% of HP lost, ATK is increased by 1% and ATK Spd is increased by 10.",
                "Per every 1% of HP lost, ATK is increased by 1.2% and ATK Spd is increased by 12.",
                "Per every 1% of HP lost, ATK is increased by 1.4% and ATK Spd is increased by 14.",
                "Per every 1% of HP lost, ATK is increased by 1.7% and ATK Spd is increased by 17.",
                "Per every 1% of HP lost, ATK is increased by 2% and ATK Spd is increased by 20."
            ],
            "introduction": "It i said that there lies a sacred beast protecting the barbarians in the Windland Snow Mountain. This beast, capable of dispelling the power of darkness, is supposed to be a blue phoenix composed of ice. Created in the shape of this beast is Numinu, its name means 'holy'. It has been crafted from enchanted ice that never melts. Considered a holy relic among Barbarians, this weapon is bestowed to their mightiest warrior. The wielder of this weapon is the most powerful warrior among Barbarians, and may be considered their king."
        },
        "treasure": {
            "name": "Barbarian Mug",
            "description": [
                "[Vortex] DMG is increased by 50%, and enemies hit by the last attack takes 5% more DMG for 10 sec.",
                "[Vortex] DMG is increased by 50%, and enemies hit by the last attack takes 6% more DMG for 10 sec.",
                "[Vortex] DMG is increased by 50%, and enemies hit by the last attack takes 7% more DMG for 10 sec.",
                "[Vortex] DMG is increased by 50%, and enemies hit by the last attack takes 8.5% more DMG for 10 sec.",
                "[Vortex] DMG is increased by 50%, and enemies hit by the last attack takes 10.5% more DMG for 10 sec.",
                "[Vortex] DMG is increased by 50%, and enemies hit by the last attack takes 12.5% more DMG for 10 sec."
            ],
            "introduction": "Mug of the Barbarian King who first settled down in the snowy mountains. When the first Barbarian King settled down in Windland, he swore to become the guardian of the snowy mountains and shared this mug with the holy beings of the mountains. To protect magic of the frost wolf imbued in the Barbarian mug increases the ATK of Vortex and the effect of freeze."
        },
        "treasure-2": {
            "name": "Fighter's Horn",
            "description": [
                "[Battle Roar] Reduces Mana Cost by 1 and increases ATK Boost by 20%.",
                "[Battle Roar] Reduces Mana Cost by 1 and increases ATK Boost by 24%.",
                "[Battle Roar] Reduces Mana Cost by 1 and increases ATK Boost by 29%.",
                "[Battle Roar] Reduces Mana Cost by 1 and increases ATK Boost by 35%.",
                "[Battle Roar] Reduces Mana Cost by 1 and increases ATK Boost by 42%.",
                "[Battle Roar] Reduces Mana Cost by 1 and increases ATK Boost by 50%."
            ],
            "introduction": "Trumpet made with the horn of the guardian beast of the Windland Snow Mountain, Orox. Orox of the Snowy Mountain grants noble warriors great power and thr ability to see the truth.<br>When a warrior who has received the blessing of Orox blows this horn, it will boost the morale of comrades and bring clarity to their minds."
        },
        "hasProfile": false
    },
    {
        "name": "Gladi",
        "class": "Assassin",
        "weapon": {
            "name": "Beast Fist, Mastra",
            "description": [
                "Upon a Crit Hit, Crit. DMG is increased by 20% for 5 sec. This effect can be stacked up to 7 times max.",
                "Upon a Crit Hit, Crit. DMG is increased by 24% for 5 sec. This effect can be stacked up to 7 times max.",
                "Upon a Crit Hit, Crit. DMG is increased by 29% for 5 sec. This effect can be stacked up to 7 times max.",
                "Upon a Crit Hit, Crit. DMG is increased by 35% for 5 sec. This effect can be stacked up to 7 times max.",
                "Upon a Crit Hit, Crit. DMG is increased by 42% for 5 sec. This effect can be stacked up to 7 times max.",
                "Upon a Crit Hit, Crit. DMG is increased by 50% for 5 sec. This effect can be stacked up to 7 times max."
            ],
            "introduction": "A pair of gauntlets custom forged for Gladi. They are proof of his winning the championship at the Orvel Arena. Supposedly, these were crafted from a legendary pair of gauntlets used by a man who was known as the War God hundreds of years ago. These gauntlets, specialized for smashing the opponent, greatly enhance the power of their wearer. However, the physical cost of using them is brutal, and no normal person can handle them. Unless the wearer is incredibly flexible, and physically capable of withstanding the impact of each blow, using them is almost suicidal. Nevertheless, Gladi's natural strength and flexibility allow him to use them freely."
        },
        "treasure": {
            "name": "Champion's Laurel Wreath",
            "description": [
                "[Ultimate Punch!] Skill cooldown is reduced by 30% and per each activation DMG is increased by 4%. This effect can be stacked max 10 times.",
                "[Ultimate Punch!] Skill cooldown is reduced by 30% and per each activation DMG is increased by 4.8%. This effect can be stacked max 10 times.",
                "[Ultimate Punch!] Skill cooldown is reduced by 30% and per each activation DMG is increased by 5.8%. This effect can be stacked max 10 times.",
                "[Ultimate Punch!] Skill cooldown is reduced by 30% and per each activation DMG is increased by 7%. This effect can be stacked max 10 times.",
                "[Ultimate Punch!] Skill cooldown is reduced by 30% and per each activation DMG is increased by 8.4%. This effect can be stacked max 10 times.",
                "[Ultimate Punch!] Skill cooldown is reduced by 30% and per each activation DMG is increased by 10%. This effect can be stacked max 10 times."
            ],
            "introduction": "Wreath given to the strongest warrior of Orbis Continent. It's only given to the winner of the fighting tournament that happens every 4 years. Those who wear this wreath are said to be able to borrow the strength of the War God."
        },
        "treasure-2": {
            "name": "Silvervine Box",
            "description": [
                "[Advent of the War God] For the skill's duration, recovers 100 MP every second and stacks 1 [This will hurt!] upon inflicting additional P.DMG.",
                "[Advent of the War God] For the skill's duration, recovers 120 MP every second and stacks 1 [This will hurt!] upon inflicting additional P.DMG.",
                "[Advent of the War God] For the skill's duration, recovers 140 MP every second and stacks 1 [This will hurt!] upon inflicting additional P.DMG.",
                "[Advent of the War God] For the skill's duration, recovers 170 MP every second and stacks 1 [This will hurt!] upon inflicting additional P.DMG.",
                "[Advent of the War God] For the skill's duration, recovers 210 MP every second and stacks 1 [This will hurt!] upon inflicting additional P.DMG.",
                "[Advent of the War God] For the skill's duration, recovers 250 MP every second and stacks 1 [This will hurt!] upon inflicting additional P.DMG."
            ],
            "introduction": "Silvervine is used to exponentially boost physical ability.<br>Nothing else, but this silvervine. Others may try chewing silvervine, drink it, boil it, but it won't work.<br>Gladi just needs this silvervine to have the effect of the War God."
        },
        "hasProfile": false
    },
    {
        "name": "Jane",
        "class": "Knight",
        "weapon": {
            "name": "Unchanging Mind, Erekura",
            "description": [
                "Per every sec, deals 10% of ATK as M.DMG to nearby enemies, and reduces their ATK by 14%. When the passive skill is activated, recovers 30% of mana.",
                "Per every sec, deals 12% of ATK as M.DMG to nearby enemies, and reduces their ATK by 17%. When the passive skill is activated, recovers 30% of mana.",
                "Per every sec, deals 14% of ATK as M.DMG to nearby enemies, and reduces their ATK by 20%. When the passive skill is activated, recovers 30% of mana.",
                "Per every sec, deals 17% of ATK as M.DMG to nearby enemies, and reduces their ATK by 24%. When the passive skill is activated, recovers 30% of mana.",
                "Per every sec, deals 20% of ATK as M.DMG to nearby enemies, and reduces their ATK by 29%. When the passive skill is activated, recovers 30% of mana.",
                "Per every sec, deals 25% of ATK as M.DMG to nearby enemies, and reduces their ATK by 35%. When the passive skill is activated, recovers 30% of mana."
            ],
            "introduction": "When Malduk's magic resurrected Jane as an undead, she should not have felt anything. Yet, she felt warm and comfortable as mysterious energy surrounded her dead body. She should not have been able to even feel it. But when Malduk took her, she instinctively reached out to the warm presence. Later, when a mysterious magic brought her back to consciousness, the first thing she did was to inspect her coffin, which radiated with tragic yet warm love. Inside, she found the following message carefully engraved: 'My unchanging love for you'."
        },
        "treasure": {
            "name": "Flowers of a Forgotten Dukedom",
            "description": [
                "[Day of Ruin] DMG is increased by 20% and with every DMG dealt, target's M.DEF is reduced by 5% for 5 sec. This effect can be stacked max 10 times.",
                "[Day of Ruin] DMG is increased by 24% and with every DMG dealt, target's M.DEF is reduced by 5% for 5 sec. This effect can be stacked max 10 times.",
                "[Day of Ruin] DMG is increased by 29% and with every DMG dealt, target's M.DEF is reduced by 5% for 5 sec. This effect can be stacked max 10 times.",
                "[Day of Ruin] DMG is increased by 35% and with every DMG dealt, target's M.DEF is reduced by 5% for 5 sec. This effect can be stacked max 10 times.",
                "[Day of Ruin] DMG is increased by 42% and with every DMG dealt, target's M.DEF is reduced by 5% for 5 sec. This effect can be stacked max 10 times.",
                "[Day of Ruin] DMG is increased by 50% and with every DMG dealt, target's M.DEF is reduced by 5% for 5 sec. This effect can be stacked max 10 times."
            ],
            "introduction": "A flower of the Republic of Grey that can no longer be found. It is also known as the Flower of Boundaries that connects life and death, and it gets its nourishment from destruction. A painfully beautiful flower. If you gift it to someone, you will be able to share that person's last moment in a dream."
        },
        "treasure-2": {
            "name": "Death-imbued Cushion",
            "description": [
                "[Mark of Death] Increases ATK by 5% and Crit DMG by 10% for 20 sec when the marked enemy dies. This effect stacks up to 8 times.",
                "[Mark of Death] Increases ATK by 5% and Crit DMG by 12% for 20 sec when the marked enemy dies. This effect stacks up to 8 times.",
                "[Mark of Death] Increases ATK by 5% and Crit DMG by 14% for 20 sec when the marked enemy dies. This effect stacks up to 8 times.",
                "[Mark of Death] Increases ATK by 5% and Crit DMG by 17% for 20 sec when the marked enemy dies. This effect stacks up to 8 times.",
                "[Mark of Death] Increases ATK by 5% and Crit DMG by 21% for 20 sec when the marked enemy dies. This effect stacks up to 8 times.",
                "[Mark of Death] Increases ATK by 5% and Crit DMG by 25% for 20 sec when the marked enemy dies. This effect stacks up to 8 times."
            ],
            "introduction": "The cushion that Jane hugs to sleep inside the coffin. It's imbued with the spirits that fell asleep with her inside the coffin.<br>They contantly give the hollowness of death to Jane."
        },
        "hasProfile": false
    },
    {
        "name": "Kaulah",
        "class": "Priest",
        "weapon": {
            "name": "The Bluewind, Coventina",
            "description": [
                "Enemies inflicted by Electrify receive 50 % of ATK as M.DMG every 5 sec, and have a 10% chance of being Stunned.",
                "Enemies inflicted by Electrify receive 50 % of ATK as M.DMG every 5 sec, and have a 12% chance of being Stunned.",
                "Enemies inflicted by Electrify receive 50 % of ATK as M.DMG every 5 sec, and have a 14% chance of being Stunned.",
                "Enemies inflicted by Electrify receive 50 % of ATK as M.DMG every 5 sec, and have a 17% chance of being Stunned.",
                "Enemies inflicted by Electrify receive 50 % of ATK as M.DMG every 5 sec, and have a 20% chance of being Stunned.",
                "Enemies inflicted by Electrify receive 50 % of ATK as M.DMG every 5 sec, and have a 25% chance of being Stunned."
            ],
            "introduction": "A staff resembling the four-winged thunderbird. Indeed, it has been crafted from a feather of a thunderbird, a beast considered holy among the Skywind Orcs. The staff has the power to communicate with the sky, read the weather, and control the air. To a Skywind shaman who uses the power of lighting, this staff i the ultimate medium."
        },
        "treasure": {
            "name": "Skywind Feather Decoration",
            "description": [
                "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 20% boost effect is added.",
                "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 24% boost effect is added.",
                "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 29% boost effect is added.",
                "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 35% boost effect is added.",
                "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 42% boost effect is added.",
                "[Swift Wind] Mana cost is reduced by 1, and Crit DMG 50% boost effect is added."
            ],
            "introduction": "Feather from a thunderbird, guardian of rain and thunder. The high ranking shamans of the Skywind Tribe commune through the feathers of a thunderbird. Shamans use this feather accessory when using Swift Wind to become one with the thunderbird., increasing ATK and ATK speed of all allies."
        },
        "treasure-2": {
            "name": "Thunderbird Mask",
            "description": [
                "[Healing Rain] Absorbs DMG of 200% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
                "[Healing Rain] Absorbs DMG of 240% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
                "[Healing Rain] Absorbs DMG of 290% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
                "[Healing Rain] Absorbs DMG of 350% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
                "[Healing Rain] Absorbs DMG of 420% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP.",
                "[Healing Rain] Absorbs DMG of 500% ATK and creates a shield that grants Immunity to CC for 1 sec when used upon allies with full HP."
            ],
            "introduction": "Mask of the auspicious thunderbird that brings rain.<br>Once the Healing Droplets of the Skywind shaman begin, the soul of the thunderbird stays by those who were hit by Healing Rain and recovers their tired bodies."
        },
        "hasProfile": false
    },
    {
        "name": "Laias",
        "class": "Priest",
        "weapon": {
            "name": "Flowing Circle, Eltoirre",
            "description": [
                "Upon a Crit Hit, heals the ally with the lowest HP by 80% of DMG dealt to target.",
                "Upon a Crit Hit, heals the ally with the lowest HP by 96% of DMG dealt to target.",
                "Upon a Crit Hit, heals the ally with the lowest HP by 115% of DMG dealt to target.",
                "Upon a Crit Hit, heals the ally with the lowest HP by 138% of DMG dealt to target.",
                "Upon a Crit Hit, heals the ally with the lowest HP by 166% of DMG dealt to target.",
                "Upon a Crit Hit, heals the ally with the lowest HP by 200% of DMG dealt to target."
            ],
            "introduction": "An ankh crafted in the shape of a phoenix. It symbolizes the natural cycle of life. In the ancient days, the nomads of the desert worshipped the blue dragon of the oasis as their protector. In return, she blessed them with rain and gave life to their crops. To show their gratitude, the nomads offered her various treasures, including Lazulia, the gem of water. Although she had no particular interest in material wealth, she accepted their gratitude, and used the treasures to build a temple within the oasis. This ankh is the sacred symbol of the temple, and contains the mighty power of water."
        },
        "treasure": {
            "name": "Papyrus of the Flow",
            "description": [
                "[Festival of the Flow] Whirlpool effect targets 2 enemies and all allies recover additional 500 mana.",
                "[Festival of the Flow] Whirlpool effect targets 2 enemies and all allies recover additional 600 mana.",
                "[Festival of the Flow] Whirlpool effect targets 2 enemies and all allies recover additional 720 mana.",
                "[Festival of the Flow] Whirlpool effect targets 2 enemies and all allies recover additional 860 mana.",
                "[Festival of the Flow] Whirlpool effect targets 2 enemies and all allies recover additional 1040 mana.",
                "[Festival of the Flow] Whirlpool effect targets 2 enemies and all allies recover additional 1250 mana."
            ],
            "introduction": "A sample of the ancient scripture, the Book of Chaos, that was swept away. The Book of Chaos is a historic scripture that is passed down to the Priest of Water, and it has records of culture, magic, and various fields. It was sealed in the Golden Shrine along with Laias, but most of the book disappeared while she was sleep. The remaining Papyrus of Flows is a boosting spell of the Festival of the Flow."
        },
        "treasure-2": {
            "name": "Oasis Crystal",
            "description": [
                "[Bubble Shield] Reduces Cooldown by 12% and dispels Negative Effects from the target.",
                "[Bubble Shield] Reduces Cooldown by 14% and dispels Negative Effects from the target.",
                "[Bubble Shield] Reduces Cooldown by 17% and dispels Negative Effects from the target.",
                "[Bubble Shield] Reduces Cooldown by 21% and dispels Negative Effects from the target.",
                "[Bubble Shield] Reduces Cooldown by 25% and dispels Negative Effects from the target.",
                "[Bubble Shield] Reduces Cooldown by 30% and dispels Negative Effects from the target."
            ],
            "introduction": "Water essence that the Blue Dragons protect. The essence of an oasist that the Blue Dragons brought to the desert at the beginning of the world. Protecting and defending this is the sacred mission of the Priestess of Water Laias, and it is her favorite thing to do. The Oasis Crystal leads the Priestess of Water who uses the Bubble Shield to the person who most needs her help."
        },
        "hasProfile": false
    },
    {
        "name": "Lakrak",
        "class": "Mechanic",
        "weapon": {
            "name": "Lakrak MK-1",
            "description": [
                "Each auto attack has a 25% chance of increasing ATK Spd by 300 for 10 sec.",
                "Each auto attack has a 25% chance of increasing ATK Spd by 360 for 10 sec.",
                "Each auto attack has a 25% chance of increasing ATK Spd by 420 for 10 sec.",
                "Each auto attack has a 25% chance of increasing ATK Spd by 510 for 10 sec.",
                "Each auto attack has a 25% chance of increasing ATK Spd by 615 for 10 sec.",
                "Each auto attack has a 25% chance of increasing ATK Spd by 750 for 10 sec."
            ],
            "introduction": "The destructive yet artistic magnum opus of a quirky Goblin inventor. This single-hand cannon packs the maximum amount of firepower a single Goblin can physically handle. Despite the dangerous amount of gunpowder used, this weapon has fortunately not blown up yet."
        },
        "treasure": {
            "name": "Goblincraft Special High-Density Gunpowder",
            "description": [
                "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 200 mana.",
                "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 240 mana.",
                "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 290 mana.",
                "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 350 mana.",
                "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 420 mana.",
                "[Glue Bomb] DMG is increased by 50%, and upon Crit Hit, recovers 500 mana."
            ],
            "introduction": "Gunpowder made with Lakrak's dangerous secret recipe. Lakrak believed that simple explosions weren't effective enough in terms of battle strategy, so he added some formic acid and stinging nettle poison to add a stunning effect. It requires an extremely accurate filtering process, and he uses it in secret to avoid abuse."
        },
        "treasure-2": {
            "name": "Special Gas Mask",
            "description": [
                "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1 sec.",
                "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1.2 sec.",
                "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1.4 sec.",
                "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 1.7 sec.",
                "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 2.1 sec.",
                "[Smoke Bomb] Reduces Cooldown by 30% and increases blind duration by 2.5 sec."
            ],
            "introduction": "A high-performing mask that was made with special materials that Lakrak obtained from around the Orbis Continent.<br>This mask is made from Harpy's first feather, a dragon's scales, a leaf from the World Tree, and the empire's mithril, which are all hard to find. This mask protects one from poisonous gas as well as the blinding effect of Smoke Bombs."
        },
        "hasProfile": false
    },
    {
        "name": "Leo",
        "class": "Priest",
        "weapon": {
            "name": "Phoenix Quill, Belisa",
            "description": [
                "Each auto attack has a 10% chance of dealing 100% extra M.DMG, and dispelling all positive effects",
                "Each auto attack has a 12% chance of dealing 100% extra M.DMG, and dispelling all positive effects",
                "Each auto attack has a 14% chance of dealing 100% extra M.DMG, and dispelling all positive effects",
                "Each auto attack has a 17% chance of dealing 100% extra M.DMG, and dispelling all positive effects",
                "Each auto attack has a 20% chance of dealing 100% extra M.DMG, and dispelling all positive effects",
                "Each auto attack has a 25% chance of dealing 100% extra M.DMG, and dispelling all positive effects"
            ],
            "introduction": "The phoenix is a holy beast that symbolizes eternal life. As elusive as the beast itself is, its feather is considered extremely rare as well. It is said that a quill crafted from a phoenix feather is a powerful magical tool in its own right. Runes drawn with this quill can serve as a powerful medium for Rune magic."
        },
        "treasure": {
            "name": "Scroll of Memories",
            "description": [
                "[Rune of Silence] Target takes 15% increased DMG for 10 sec, and target's CC resistance is reduced by 120.",
                "[Rune of Silence] Target takes 15% increased DMG for 10 sec, and target's CC resistance is reduced by 140.",
                "[Rune of Silence] Target takes 15% increased DMG for 10 sec, and target's CC resistance is reduced by 170.",
                "[Rune of Silence] Target takes 15% increased DMG for 10 sec, and target's CC resistance is reduced by 210.",
                "[Rune of Silence] Target takes 15% increased DMG for 10 sec, and target's CC resistance is reduced by 250.",
                "[Rune of Silence] Target takes 15% increased DMG for 10 sec, and target's CC resistance is reduced by 300."
            ],
            "introduction": "Ancient sorcery codex. A codex written by respected sorcerers that contains the principle behind magic that uses all of life and creation. It's written in an unknown language, so only part of it can be decoded. If the ancient text system is discovered, it might be possible to use spells without any cost whatsoever."
        },
        "treasure-2": {
            "name": "Ink of Vitality",
            "description": [
                "[Rune of Healing] Increases Heal Rate by 50% and P.Crit Resistance of allies by 100 for 10 sec.",
                "[Rune of Healing] Increases Heal Rate by 50% and P.Crit Resistance of allies by 120 for 10 sec.",
                "[Rune of Healing] Increases Heal Rate by 50% and P.Crit Resistance of allies by 140 for 10 sec.",
                "[Rune of Healing] Increases Heal Rate by 50% and P.Crit Resistance of allies by 170 for 10 sec.",
                "[Rune of Healing] Increases Heal Rate by 50% and P.Crit Resistance of allies by 210 for 10 sec.",
                "[Rune of Healing] Increases Heal Rate by 50% and P.Crit Resistance of allies by 250 for 10 sec."
            ],
            "introduction": "Ink made by extracting young leaves from the World Tree. Only 10 droplets can be produced in a year.<br>The magic spells written with this ink grant great vitality to the body.<br>It's very precious and hard to obtain, so Leo doesn't use it unless it's for a special occasion."
        },
        "hasProfile": false
    },
    {
        "name": "Lewisia",
        "class": "Wizard",
        "weapon": {
            "name": "Scarlet Ruler, Dominicia",
            "description": [
                "If HP is over 50%, ATK is increased by 20%. If HP is under 50%, takes 10% reduced DMG.",
                "If HP is over 50%, ATK is increased by 24%. If HP is under 50%, takes 12% reduced DMG.",
                "If HP is over 50%, ATK is increased by 29%. If HP is under 50%, takes 14% reduced DMG.",
                "If HP is over 50%, ATK is increased by 35%. If HP is under 50%, takes 17% reduced DMG.",
                "If HP is over 50%, ATK is increased by 42%. If HP is under 50%, takes 21% reduced DMG.",
                "If HP is over 50%, ATK is increased by 50%. If HP is under 50%, takes 25% reduced DMG."
            ],
            "introduction": "A staff of blood that has been passed down in the family of the Vampire Lord through the generations. Its crimson color symbolizes the authority, insight, and the absolute power of the Vampire Lord. Deep in the underground of the Galia Plains is the holy land of the Vampires. This legendary staff lies there, ready to appear at the call of the master worthy of it, wherever that may be."
        },
        "treasure": {
            "name": "Blood of the Ancients",
            "description": [
                "[Blood Banquet] DMG is increased by 20%, and upon Crit Hit, recovers 400 mana.",
                "[Blood Banquet] DMG is increased by 24%, and upon Crit Hit, recovers 400 mana.",
                "[Blood Banquet] DMG is increased by 29%, and upon Crit Hit, recovers 400 mana.",
                "[Blood Banquet] DMG is increased by 35%, and upon Crit Hit, recovers 400 mana.",
                "[Blood Banquet] DMG is increased by 42%, and upon Crit Hit, recovers 400 mana.",
                "[Blood Banquet] DMG is increased by 50%, and upon Crit Hit, recovers 400 mana."
            ],
            "introduction": "Ancient vampire queen's blood. The more pure-blooded a vampire is, the stronger their mana blood. The greatest of them all is the ancient vampire queen's blood, and the vampires who drink her blood will have unlimited life and mana. It is a highly addictive type of blood, so be careful when using it."
        },
        "treasure-2": {
            "name": "Spell of Bloody Mist",
            "description": [
                "[Blood Zone] Increases DMG by 20% and the effect duration by 2 sec.",
                "[Blood Zone] Increases DMG by 24% and the effect duration by 2 sec.",
                "[Blood Zone] Increases DMG by 29% and the effect duration by 2 sec.",
                "[Blood Zone] Increases DMG by 35% and the effect duration by 2 sec.",
                "[Blood Zone] Increases DMG by 42% and the effect duration by 2 sec.",
                "[Blood Zone] Increases DMG by 50% and the effect duration by 2 sec."
            ],
            "introduction": "Magic tool of the successor of blood.<br>The spells of the pure Vampire Lord's family have been passed down through generations. The successor of Lewisia is Vampire Sir Lusben, and the Spell of Bloody Mist is a gift from him. Lewisia hates anything that has to do with being a successor, but she likes how the Blood Zone reduces her fatigue, so she enjoys using it."
        },
        "hasProfile": false
    },
    {
        "name": "Lorraine",
        "class": "Wizard",
        "weapon": {
            "name": "World Tree's Will, Roburu",
            "description": [
                "Every 7 sec, deals 40% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 10%. Per every stacked Poison, DMG is increased by 20%.",
                "Every 7 sec, deals 48% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 12%. Per every stacked Poison, DMG is increased by 20%.",
                "Every 7 sec, deals 57% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 14%. Per every stacked Poison, DMG is increased by 20%.",
                "Every 7 sec, deals 69% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 17%. Per every stacked Poison, DMG is increased by 20%.",
                "Every 7 sec, deals 83% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 20%. Per every stacked Poison, DMG is increased by 20%.",
                "Every 7 sec, deals 100% of ATK as M.DMG to enemies inflicted with Poison, and reduces enemy M.DEF by 25%. Per every stacked Poison, DMG is increased by 20%."
            ],
            "introduction": "The legend has it that, once every 100 years, the World Tree bestows one of its branches to a chosen once. The branch radiates with eternal life, gaining immense power and knowledge to its owner. Fusing the branch with the stone of the Forest, an Elven Treasure, Lorraine created this staff. Now, she can call upon the forces of nature and remain connected to the World Tree wherever she goes."
        },
        "treasure": {
            "name": "Root of the World Tree",
            "description": [
                "[Wrath of the Forest] DMG is increased by 20%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
                "[Wrath of the Forest] DMG is increased by 24%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
                "[Wrath of the Forest] DMG is increased by 29%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
                "[Wrath of the Forest] DMG is increased by 35%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
                "[Wrath of the Forest] DMG is increased by 42%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%.",
                "[Wrath of the Forest] DMG is increased by 50%. Upon Crit Hit on enemies with over 5 stacks of Poison, skill cooldown is reduced by 4%."
            ],
            "introduction": "Proof of the unity between the Druids and the World Tree. The great sages of Elidora have always maintained a deep bond with the World Tree. The roots of the World Tree are proof of its deep bond with the Druids. They attack enemies with supernatural DMG whenever Druids shout the Wrath of the Forest to show nature's fury and hostility."
        },
        "treasure-2": {
            "name": "Deadly Belladonna",
            "description": [
                "[Tangled Vine] Reduces Mana Cost by 1 and drains 200 MP from the affected enemy.",
                "[Tangled Vine] Reduces Mana Cost by 1 and drains 240 MP from the affected enemy.",
                "[Tangled Vine] Reduces Mana Cost by 1 and drains 290 MP from the affected enemy.",
                "[Tangled Vine] Reduces Mana Cost by 1 and drains 350 MP from the affected enemy.",
                "[Tangled Vine] Reduces Mana Cost by 1 and drains 420 MP from the affected enemy.",
                "[Tangled Vine] Reduces Mana Cost by 1 and drains 500 MP from the affected enemy."
            ],
            "introduction": "The beautiful but poisonous Belladonna.<br>It's a dangerous plant that only the Great Sage can handle. The little Belladonna that is mixed up with vines poisons enemies and makes them defenseless against magic attacks."
        },
        "hasProfile": false
    },
    {
        "name": "Luna",
        "class": "Archer",
        "weapon": {
            "name": "Flower of Eternity, Hyacinth",
            "description": [
                "Increases DMG of normal attacks by 20% and the Range by 6%.",
                "Increases DMG of normal attacks by 24% and the Range by 7.2%.",
                "Increases DMG of normal attacks by 29% and the Range by 8.6%.",
                "Increases DMG of normal attacks by 35% and the Range by 10.5%.",
                "Increases DMG of normal attacks by 42% and the Range by 12.5%.",
                "Increases DMG of normal attacks by 50% and the Range by 15%."
            ],
            "introduction": "A slingshot made from hyacinth, a silver tree that only grows in extremely cold regions. It is said that hyacinths have been blessed by the Queen of ice, and are able to bear bright red fruits even in the coldest weather. Simply holding onto a hyacinth branch allows one to ignore coldness around the holder. These blessed trees also have the power to call upon snowstorms and frost. Needless to say, these powers are best harnessed by the weapon carved from one of these trees."
        },
        "treasure": {
            "name": "Never-Melting Snow Flower",
            "description": [
                "[Twinkle Twinkle] DMG is increased by 20% and target inflicted with Crit Chance reduction cannot dispel the effect.",
                "[Twinkle Twinkle] DMG is increased by 24% and target inflicted with Crit Chance reduction cannot dispel the effect.",
                "[Twinkle Twinkle] DMG is increased by 29% and target inflicted with Crit Chance reduction cannot dispel the effect.",
                "[Twinkle Twinkle] DMG is increased by 35% and target inflicted with Crit Chance reduction cannot dispel the effect.",
                "[Twinkle Twinkle] DMG is increased by 42% and target inflicted with Crit Chance reduction cannot dispel the effect.",
                "[Twinkle Twinkle] DMG is increased by 50% and target inflicted with Crit Chance reduction cannot dispel the effect."
            ],
            "introduction": "A legendary snowfield flower that blossomed from the never melting Land of Windland Snow Mountain. It is said that it makes the energy of it's master's body from clearly and beautifully. An item that makes Luna's pure energy shine even brighter."
        },
        "treasure-2": {
            "name": "Moonlight Carrot",
            "description": [
                "[Look Out Above!] Increases DMG by 20% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Look Out Above!] Increases DMG by 24% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Look Out Above!] Increases DMG by 29% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Look Out Above!] Increases DMG by 35% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Look Out Above!] Increases DMG by 42% and reduces Cooldown by 10% upon a Crit Hit.",
                "[Look Out Above!] Increases DMG by 50% and reduces Cooldown by 10% upon a Crit Hit."
            ],
            "introduction": "A carrot that grew from receiving moonlight a thousand times.<br>Those hit by this carrot will have all evil stripped away from them, and they'll be able to tell apart good from bad."
        },
        "hasProfile": false
    },
    {
        "name": "Maria",
        "class": "Wizard",
        "weapon": {
            "name": "Lea's Messenger, Cocytus",
            "description": [
                "Upon a critical hit, deal continuous M. DMG equal to 300% of ATK to the enemy for 10 sec and reduce their recovery rate by 50%.",
                "Upon a critical hit, deal continuous M. DMG equal to 375% of ATK to the enemy for 10 sec and reduce their recovery rate by 50%.",
                "Upon a critical hit, deal continuous M. DMG equal to 450% of ATK to the enemy for 10 sec and reduce their recovery rate by 50%.",
                "Upon a critical hit, deal continuous M. DMG equal to 525% of ATK to the enemy for 10 sec and reduce their recovery rate by 50%.",
                "Upon a critical hit, deal continuous M. DMG equal to 625% of ATK to the enemy for 10 sec and reduce their recovery rate by 50%.",
                "Upon a critical hit, deal continuous M. DMG equal to 750% of ATK to the enemy for 10 sec and reduce their recovery rate by 50%."
            ],
            "introduction": "A mysterious raven that can travel across dimensions. Its intelligence and shrewdness are certainly not those of a mere bird. In truth, it is a monster filled with dark energy, much like Demons. Indeed, it is said that this beast is as powerful as a high-ranking demon. Some claim that it occasionally flies over fields of battle, speaking in human languages. Much of this creature's identity is till shrouded in mystery."
        },
        "treasure": {
            "name": "Pendant of Darkness",
            "description": [
                "[Area of Darkness] DMG is increased by 20%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                "[Area of Darkness] DMG is increased by 24%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                "[Area of Darkness] DMG is increased by 29%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                "[Area of Darkness] DMG is increased by 35%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                "[Area of Darkness] DMG is increased by 42%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec.",
                "[Area of Darkness] DMG is increased by 50%, and the last attack reduces target's P.DEF and M.DEF by 30% for 7 sec."
            ],
            "introduction": "Ashes of a grey messenger that announces the end. These are the ashes of a raven that flew into the Church of Lua right before the Republic of Grey collapsed a hundred years ago. Everyone ignored the ominous messenger, and only Priestess Maria cared for it until its last day. Even after its death, it has helped Maria expand her area of darkness by pouring its dark energy on her."
        },
        "treasure-2": {
            "name": "Spirit's Sabaton",
            "description": [
                "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 10% for 10 sec.",
                "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 12% for 10 sec.",
                "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 14% for 10 sec.",
                "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 17% for 10 sec.",
                "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 21% for 10 sec.",
                "[Claw of Restriction] Increases DMG by 50% and increases M.Weakness of the affected enemy by 25% for 10 sec."
            ],
            "introduction": "A claw armor that Maria gifted to Lea's messenger.<br>The claw armor that is made with fancy gold contains a binding curse that never lets go of any enemy that it grabs. Enemies bound by the messenger's Sabaton will become defenseless against magic attacks and will receive great damage."
        },
        "hasProfile": false
    },
    {
        "name": "May",
        "class": "Priest",
        "weapon": {
            "name": "The Box of Fragrance, Etelia",
            "description": [
                "Upon activating 'Take this!', applies the effects of 'Take anything!' to all allies and reduces cooldown of all own skills by 10%.",
                "Upon activating 'Take this!', applies the effects of 'Take anything!' to all allies and reduces cooldown of all own skills by 12%.",
                "Upon activating 'Take this!', applies the effects of 'Take anything!' to all allies and reduces cooldown of all own skills by 14%.",
                "Upon activating 'Take this!', applies the effects of 'Take anything!' to all allies and reduces cooldown of all own skills by 17%.",
                "Upon activating 'Take this!', applies the effects of 'Take anything!' to all allies and reduces cooldown of all own skills by 20%.",
                "Upon activating 'Take this!', applies the effects of 'Take anything!' to all allies and reduces cooldown of all own skills by 25%."
            ],
            "introduction": "A curious basket always carried by May whenever she goes hunting for new materials. This mysterious basket contains an infinite amount of space, and turns anything that enters it weightless. This allows May to bring back a ridiculous number of items from a single trip. At quick glance, it might as well be filled with picnic foods. However, rumors claim that, whenever she takes it to her hunting trips, she packs it with ... ... Other questionable things. Or so they say."
        },
        "treasure": {
            "name": "Crystal Ball from Unknown Origin",
            "description": [
                "[Not for sale!] DMG is increased by 20% and attacks the enemy 1 more time.",
                "[Not for sale!] DMG is increased by 24% and attacks the enemy 1 more time.",
                "[Not for sale!] DMG is increased by 29% and attacks the enemy 1 more time.",
                "[Not for sale!] DMG is increased by 35% and attacks the enemy 1 more time.",
                "[Not for sale!] DMG is increased by 42% and attacks the enemy 1 more time.",
                "[Not for sale!] DMG is increased by 50% and attacks the enemy 1 more time."
            ],
            "introduction": "During the days of the ancient civilization, someone stole the spells of the sages and gathered their power in a single crystal ball. It seems like it was part of a plan to become the greatest shaman at the time. But there are no historic records of this crystal ball, and it was found away from the village, near Eden River. Different elemental spells are mixed up in one place, making it dangerous, so it's unknown how its powers will be released."
        },
        "treasure-2": {
            "name": "Sweet Piece of Cake",
            "description": [
                "[Cheer Up!] Increases Heal Rate by 20% and the chance of double Heal Rate by 20% additionally.",
                "[Cheer Up!] Increases Heal Rate by 24% and the chance of double Heal Rate by 20% additionally.",
                "[Cheer Up!] Increases Heal Rate by 29% and the chance of double Heal Rate by 20% additionally.",
                "[Cheer Up!] Increases Heal Rate by 35% and the chance of double Heal Rate by 20% additionally.",
                "[Cheer Up!] Increases Heal Rate by 42% and the chance of double Heal Rate by 20% additionally.",
                "[Cheer Up!] Increases Heal Rate by 50% and the chance of double Heal Rate by 20% additionally."
            ],
            "introduction": "Special cake made by Juno. Its smells very sweet.<br><br>May loves it as a snack. No one knows why she doesn't tell anyone what she put in it."
        },
        "hasProfile": false
    },
    {
        "name": "Mediana",
        "class": "Priest",
        "weapon": {
            "name": "Merciful Threat, Phistonia",
            "description": [
                "Special Poison DMG is increased by 40% and targets inflicted by Poison take 30% of Mediana's ATK as extra P.DMG when hit by allies other than Mediana. Additional P.DMG effect activates only once per 1 sec.",
                "Special Poison DMG is increased by 48% and targets inflicted by Poison take 36% of Mediana's ATK as extra P.DMG when hit by allies other than Mediana. Additional P.DMG effect activates only once per 1 sec.",
                "Special Poison DMG is increased by 57% and targets inflicted by Poison take 43% of Mediana's ATK as extra P.DMG when hit by allies other than Mediana. Additional P.DMG effect activates only once per 1 sec.",
                "Special Poison DMG is increased by 69% and targets inflicted by Poison take 52% of Mediana's ATK as extra P.DMG when hit by allies other than Mediana. Additional P.DMG effect activates only once per 1 sec.",
                "Special Poison DMG is increased by 83% and targets inflicted by Poison take 62% of Mediana's ATK as extra P.DMG when hit by allies other than Mediana. Additional P.DMG effect activates only once per 1 sec.",
                "Special Poison DMG is increased by 100% and targets inflicted by Poison take 75% of Mediana's ATK as extra P.DMG when hit by allies other than Mediana. Additional P.DMG effect activates only once per 1 sec."
            ],
            "introduction": "The story goes back to when Mediana's poison experiments were still being kept secret from her peers. One day, a fellow doctor noticed the giant syringe she had made. Impressed by its sheer size, he asked her: 'Look at the size of that thing. Should't you at least give it a name?' To this, Mediana replied, nonchalantly: 'Oh...just call it... Piston.'"
        },
        "treasure": {
            "name": "Mysterious Potion",
            "description": [
                "[Strengthening Potion] dispels target's negative effects and target gains immunity to CC for 2 sec.",
                "[Strengthening Potion] dispels target's negative effects and target gains immunity to CC for 3 sec.",
                "[Strengthening Potion] dispels target's negative effects and target gains immunity to CC for 4 sec.",
                "[Strengthening Potion] dispels target's negative effects and target gains immunity to CC for 5 sec.",
                "[Strengthening Potion] dispels target's negative effects and target gains immunity to CC for 6 sec.",
                "[Strengthening Potion] dispels target's negative effects and target gains immunity to CC for 7 sec."
            ],
            "introduction": "A special potion that has the teachings of a master. The genius surgeon and expert on anatomy. Doctor Aldini, is Mediana's master. Doctor Aldini recognized her talent early on, and he taught her extraordinary medical knowledge that couldn't have been imagined in the Church of Lua. The unidentifiable potion that was made with her master's special recipe increases the effect of the Strengthening Potion."
        },
        "treasure-2": {
            "name": "Special Potion of Double Reaction",
            "description": [
                "[Special Water Cannon] Increases Resistance by 30% and reduces Cooldown by 12%.",
                "[Special Water Cannon] Increases Resistance by 30% and reduces Cooldown by 14%.",
                "[Special Water Cannon] Increases Resistance by 30% and reduces Cooldown by 17%.",
                "[Special Water Cannon] Increases Resistance by 30% and reduces Cooldown by 21%.",
                "[Special Water Cannon] Increases Resistance by 30% and reduces Cooldown by 25%.",
                "[Special Water Cannon] Increases Resistance by 30% and reduces Cooldown by 30%."
            ],
            "introduction": "A special potion that has two type of effects. Mediana wondered if there was a way to handle attack and recovery at once. She went to the library and read a dusty book called 'Slimes Can Also Make Cannons.'<br>Mediana was reading just for fun, but found a way to apply the principle of cannons into her piston. She was then able to invent the Special Potion of Double Reaction and maximize recovery and attack when using Special Water Cannon. Mediana is still thankful to the author of the book who gave her the inspiration."
        },
        "hasProfile": false
    },
    {
        "name": "Mirianne",
        "class": "Assassin",
        "weapon": {
            "name": "Endless Acceleration, Riventina",
            "description": [
                "Increases ATK Spd by 200, and attacks on Locked On enemies, dealing 200% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
                "Increases ATK Spd by 240, and attacks on Locked On enemies, dealing 240% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
                "Increases ATK Spd by 290, and attacks on Locked On enemies, dealing 290% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
                "Increases ATK Spd by 350, and attacks on Locked On enemies, dealing 350% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
                "Increases ATK Spd by 420, and attacks on Locked On enemies, dealing 420% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec.",
                "Increases ATK Spd by 500, and attacks on Locked On enemies, dealing 500% of ATK as extra M.DMG. Extra damage effect occurs once in 2 sec."
            ],
            "introduction": "A magic gear created by Sonia, the Archmage of Blue. It is enchanted with magic that allows it to reach incredible speeds. It is also enchanted with a special spell that always guides it back to its owner after it's thrown. It is the best gift Sonia could give to Mirianne, who is both a family and friend to her. In other words, it's a weapon expression of love reserved only for Mirianne."
        },
        "treasure": {
            "name": "Magic Powder of Lightning",
            "description": [
                "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 10% for 10 sec.",
                "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 12% for 10 sec.",
                "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 14% for 10 sec.",
                "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 17% for 10 sec.",
                "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 21% for 10 sec.",
                "[Assassination] DMG is increased by 50% and upon Crit Hit increases own ATK by 25% for 10 sec."
            ],
            "introduction": "A collection of beautiful matter that is sprayed in Sonia's crystal ball like stars. Mirianne collected it to pull a prank, but it;s so powerful that it;s being used as a tool for assassination."
        },
        "treasure-2": {
            "name": "Gemini Ring of Instant Teleportation",
            "description": [
                "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 120 Mana.",
                "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 140 Mana.",
                "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 170 Mana.",
                "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 210 Mana.",
                "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 250 Mana.",
                "[Restrain and Protect] Reduces Mana Cost by 1 and upon Crit hit recovers 300 Mana."
            ],
            "introduction": "Ring that Mirianne purchased at the 'Amazing Magic Toy Shop' in Orvel. She engraved Sonia's and her name in the ring. The two make a set, and it allows each other to teleport to the location of the other once a day. Though, Sonia doesn't use it since it's troublesome...<br>It may be a toy, but Mirianne is happy that there's one more way for her to protect Sonia."
        },
        "hasProfile": false
    },
    {
        "name": "Miruru",
        "class": "Mechanic",
        "weapon": {
            "name": "Ultimate Weapon, Leviathan",
            "description": [
                "Deals P.DMG equal to 100% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 20% more P.DMG for 5 seconds.",
                "Deals P.DMG equal to 120% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 24% more P.DMG for 5 seconds.",
                "Deals P.DMG equal to 140% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 29% more P.DMG for 5 seconds.",
                "Deals P.DMG equal to 170% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 35% more P.DMG for 5 seconds.",
                "Deals P.DMG equal to 210% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 42% more P.DMG for 5 seconds.",
                "Deals P.DMG equal to 250% of ATK to the enemies inflicted by the Boooooom! skill at a 50% chance, and the target takes 50% more P.DMG for 5 seconds."
            ],
            "introduction": "Back when Miruru reigned as the pirate empress, she was feared by sailors and a major threat to the naval forces of Orvelia and the empire. The cannons on her ship were especially terrifying to the Navy. The most powerful of them was the Leviathan, the ship's main cannon. After being cursed, she took one thing with her as she fled from her mutinous crew. Its value as a weapon is in fact more valuable than any gold or loot. She took with her the Leviathan, the most powerful cannon in her arsenal. After numerous modifications, the once-terror of the sea now serves as a mobile artillery."
        },
        "treasure": {
            "name": "Miruru Cannonball",
            "description": [
                "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 12%.",
                "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 14%.",
                "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 17%.",
                "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 21%.",
                "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 25%.",
                "[Miruru Pirates!] DMG is increased by 50%, and skill cooldown is reduced by 30%."
            ],
            "introduction": "Cannoball engraved with the symbol of the Miruru Pirates. Miruru still vividly remembers her glorious past. Her fluttering flag emblazoned with a shark, and the sounds of explosions that were at her command. Those fond memories of enemy ships sinking in terror still remain within her. Miruru is using special cannonballs to attack enemies, while waiting for the glorious days to come back once again."
        },
        "treasure-2": {
            "name": "Pirate King's Sextant",
            "description": [
                "[Roll Over] increases DMG by 4% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
                "[Roll Over] increases DMG by 4.8% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
                "[Roll Over] increases DMG by 5.8% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
                "[Roll Over] increases DMG by 7% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
                "[Roll Over] increases DMG by 8.4% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times.",
                "[Roll Over] increases DMG by 10% on every use and recovers 120 MP upon a Crit Hit. This effect stacks up to max 10 times."
            ],
            "introduction": "Sextant of Pirate King Olga, who was the first to discover the new continent.<br>Pirate King Olga went past the Orbis Continent to find a new continent, following a revelation from the gods. The sextant can calculate the most accurate location and angle in the world. Miruru uses the sextant to boost the damage from rolling bomb attacks, but she doesn't remember how she ended up with it."
        },
        "hasProfile": false
    },
    {
        "name": "Mitra",
        "class": "Mechanic",
        "weapon": {
            "name": "Roar of Madness, Velkinoth",
            "description": [
                "Each auto attack increases Penetration and ATK Spd by 8. Can be stacked up to 30 times max.",
                "Each auto attack increases Penetration and ATK Spd by 10. Can be stacked up to 30 times max.",
                "Each auto attack increases Penetration and ATK Spd by 12. Can be stacked up to 30 times max.",
                "Each auto attack increases Penetration and ATK Spd by 14. Can be stacked up to 30 times max.",
                "Each auto attack increases Penetration and ATK Spd by 17. Can be stacked up to 30 times max.",
                "Each auto attack increases Penetration and ATK Spd by 20. Can be stacked up to 30 times max."
            ],
            "introduction": "A pair of magical weapons that absorb the bloodlust of their user to enhance their own firepower. Each pull of their trigger pushes the user deeper and deeper into the craze of the battle. It is said that when a master craftsman creates a weapon, it develops a soul. Berkinos seem to have the soul of the war god. According to the story, when their creator pulled their triggers for the first time, he suddenly turned pale with terror and threw them into a river."
        },
        "treasure": {
            "name": "Wolfhead Mercenary Insignia",
            "description": [
                "[Dance with me!!] DMG is increased by 20% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
                "[Dance with me!!] DMG is increased by 24% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
                "[Dance with me!!] DMG is increased by 29% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
                "[Dance with me!!] DMG is increased by 35% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
                "[Dance with me!!] DMG is increased by 42% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times.",
                "[Dance with me!!] DMG is increased by 50% and per every activation, skill cooldown is reduced by 5%. This effect can be stacked max 8 times."
            ],
            "introduction": "Rune of the greatest mercenaries. the Steel Wolves. A rune that symbolizes the mercenary Steel Wolves, who were called the demons of the battlefield. Mitra was called the Silver Wolf of the battlefield. Even after he's left the mercenaries, he carries it in remembrance of the battle against the naval officer of the empire."
        },
        "treasure-2": {
            "name": "Wolf's Barrage Box",
            "description": [
                "[Time to Die!] Increases Crit DMG by 20% for the skill's duration. HP cannot be reduced below 10% for 3 sec.",
                "[Time to Die!] Increases Crit DMG by 24% for the skill's duration. HP cannot be reduced below 10% for 3 sec.",
                "[Time to Die!] Increases Crit DMG by 29% for the skill's duration. HP cannot be reduced below 10% for 3 sec.",
                "[Time to Die!] Increases Crit DMG by 35% for the skill's duration. HP cannot be reduced below 10% for 3 sec.",
                "[Time to Die!] Increases Crit DMG by 42% for the skill's duration. HP cannot be reduced below 10% for 3 sec.",
                "[Time to Die!] Increases Crit DMG by 50% for the skill's duration. HP cannot be reduced below 10% for 3 sec."
            ],
            "introduction": "Steel Wolf's special barrage box.<br>The Steel Wolves were infamous for being too violent and making it impossible to revitalize their enemies.<br>The most infamous Silver Wolf only uses the maximized Wolf Barrage Box that he got from the owner of the Gold Bar."
        },
        "hasProfile": false
    },
    {
        "name": "Morrah",
        "class": "Knight",
        "weapon": {
            "name": "Flame of Victory, Carprain",
            "description": [
                "Every 10 sec, deals 80% of ATK as M.DMG to enemies inflicted with Flame and has a 14% chance of knocking them down. Per every stacked Flame, DMG is increased by 2%.",
                "Every 10 sec, deals 96% of ATK as M.DMG to enemies inflicted with Flame and has a 16% chance of knocking them down. Per every stacked Flame, DMG is increased by 2%.",
                "Every 10 sec, deals 115% of ATK as M.DMG to enemies inflicted with Flame and has a 20% chance of knocking them down. Per every stacked Flame, DMG is increased by 2%.",
                "Every 10 sec, deals 138% of ATK as M.DMG to enemies inflicted with Flame and has a 24% chance of knocking them down. Per every stacked Flame, DMG is increased by 2%.",
                "Every 10 sec, deals 166% of ATK as M.DMG to enemies inflicted with Flame and has a 29% chance of knocking them down. Per every stacked Flame, DMG is increased by 2%.",
                "Every 10 sec, deals 200% of ATK as M.DMG to enemies inflicted with Flame and has a 35% chance of knocking them down. Per every stacked Flame, DMG is increased by 2%."
            ],
            "introduction": "In the heart of the Dragia Volcano, there exists a smithy. Hundreds of years ago, Temeraire, the ancient fire dragon, created a set of magically enchanted gear. Using lava infused with the power of the volcanic fire, he forged a shield and a sword capable of incinerating anything. During the war against the Demons, Temeraire presented these to a human warrior. Unfortunately, the warrior is said to have been defeated by Morrah. No one has seen this legendary gear since then. That is, until Morrah reappeared on the front line."
        },
        "treasure": {
            "name": "Hellish Sealing Stone",
            "description": [
                "[Lava Eruption] DMG is increased by 20% and target's M.DEF is decreased by 25% for 7 sec.",
                "[Lava Eruption] DMG is increased by 24% and target's M.DEF is decreased by 25% for 7 sec.",
                "[Lava Eruption] DMG is increased by 29% and target's M.DEF is decreased by 25% for 7 sec.",
                "[Lava Eruption] DMG is increased by 35% and target's M.DEF is decreased by 25% for 7 sec.",
                "[Lava Eruption] DMG is increased by 42% and target's M.DEF is decreased by 25% for 7 sec.",
                "[Lava Eruption] DMG is increased by 50% and target's M.DEF is decreased by 25% for 7 sec."
            ],
            "introduction": "A strange fragment that came from the Dimensional Rift. Inside the fragment, there's a flame that kills anything that is living. The energy from its dimension is condensed within it, it's absolutely needed to complete Maria's plan."
        },
        "treasure-2": {
            "name": "Hatchling Leather Gloves",
            "description": [
                "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 100 and M.Crit resistance is increased by 250.",
                "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 120 and M.Crit resistance is increased by 250.",
                "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 140 and M.Crit resistance is increased by 250.",
                "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 170 and M.Crit resistance is increased by 250.",
                "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 210 and M.Crit resistance is increased by 250.",
                "[Hellfire] Upon blocking target's M.ATK during the skill's duration, DMG reduction is increased by 250 and M.Crit resistance is increased by 250."
            ],
            "introduction": "Gloves made with a dark Hatchling's bones and skin.<br>Morrah made it a hundred years ago by collecting the Hatchlings she killed when she went out to hunt dragons.<br>It's very durable to even withstand Morrah's flames, and even imbues a stronger power to let those flames blaze up even more.<br>Morrah really likes these gloves."
        },
        "hasProfile": false
    },
    {
        "name": "Naila",
        "class": "Warrior",
        "weapon": {
            "name": "Cursed Claws, Baroro",
            "description": [
                "Upon a Crit Hit, deals 100% of ATK as P.DMG over time for 10sec. Target takes 20% increased P.DMG for the duration of skill.",
                "Upon a Crit Hit, deals 120% of ATK as P.DMG over time for 10sec. Target takes 24% increased P.DMG for the duration of skill.",
                "Upon a Crit Hit, deals 144% of ATK as P.DMG over time for 10sec. Target takes 28% increased P.DMG for the duration of skill.",
                "Upon a Crit Hit, deals 172% of ATK as P.DMG over time for 10sec. Target takes 34% increased P.DMG for the duration of skill.",
                "Upon a Crit Hit, deals 207% of ATK as P.DMG over time for 10sec. Target takes 41% increased P.DMG for the duration of skill.",
                "Upon a Crit Hit, deals 250% of ATK as P.DMG over time for 10sec. Target takes 50% increased P.DMG for the duration of skill."
            ],
            "introduction": "A cursed pair of gauntlets crafted from the claws of the Mad Demon Baroro, which was defeated during the war. Several times the size of average human hands, these gauntlets directly connect to the nerves of the wearer, allowing its wielder to control them effortlessly. Although they grant immense power, they also break the mind of the wearer, slowly eating away at the soul. Only a true warrior of noble conviction, strong will and undying spirit may handle these cursed weapons. They are the perfect weapons for a warrior with a strong will that shines even in the darkness of the abyss."
        },
        "treasure": {
            "name": "Tempest Pride",
            "description": [
                "[Dive Bomb] Skill cooldown is reduced by 30% and target takes 10% more P.DMG for 10 sec.",
                "[Dive Bomb] Skill cooldown is reduced by 30% and target takes 12% more P.DMG for 10 sec.",
                "[Dive Bomb] Skill cooldown is reduced by 30% and target takes 14% more P.DMG for 10 sec.",
                "[Dive Bomb] Skill cooldown is reduced by 30% and target takes 17% more P.DMG for 10 sec.",
                "[Dive Bomb] Skill cooldown is reduced by 30% and target takes 21% more P.DMG for 10 sec.",
                "[Dive Bomb] Skill cooldown is reduced by 30% and target takes 25% more P.DMG for 10 sec."
            ],
            "introduction": "A ritual offering of ancient religious people who worshiped the wind. It is a precious treasure among the Harpies, and it said to be given to the most powerful Harpy warrior. The moment one wears this mask, they'll be able to freely use the wind. They can also attack at the speed of light."
        },
        "treasure-2": {
            "name": "Himmullis's Scarf",
            "description": [
                "[Wind Reading] Increases ATK Boost by 50% and M.Dodge by 100.",
                "[Wind Reading] Increases ATK Boost by 50% and M.Dodge by 120.",
                "[Wind Reading] Increases ATK Boost by 50% and M.Dodge by 140.",
                "[Wind Reading] Increases ATK Boost by 50% and M.Dodge by 170.",
                "[Wind Reading] Increases ATK Boost by 50% and M.Dodge by 210.",
                "[Wind Reading] Increases ATK Boost by 50% and M.Dodge by 250."
            ],
            "introduction": "The scarf that the dead Himmullis had on. Naila always has it on her.<br>Himmullis use to always tell Naila to be proud of being a Harpy.<br>The scarf contains the sadness of losing family, and this makes Naila furious."
        },
        "hasProfile": false
    },
    {
        "name": "Nyx",
        "class": "Wizard",
        "weapon": {
            "name": "Dimensional Key, Magnus Fille",
            "description": [
                "Auto Attack penetrates through enemies in a straight line and DMG is increased by 30%. Per each blade stack, DMG is increased by an extra 4%.",
                "Auto Attack penetrates through enemies in a straight line and DMG is increased by 36%. Per each blade stack, DMG is increased by an extra 4.8%.",
                "Auto Attack penetrates through enemies in a straight line and DMG is increased by 43%. Per each blade stack, DMG is increased by an extra 5.7%.",
                "Auto Attack penetrates through enemies in a straight line and DMG is increased by 52%. Per each blade stack, DMG is increased by an extra 6.9%.",
                "Auto Attack penetrates through enemies in a straight line and DMG is increased by 62%. Per each blade stack, DMG is increased by an extra 8.3%.",
                "Auto Attack penetrates through enemies in a straight line and DMG is increased by 75%. Per each blade stack, DMG is increased by an extra 10%."
            ],
            "introduction": "There exists a universal string that connects different dimensions. This sword is the key that can sever and reconnect this sting. It is bestowed upon the dimensional arbitrator sworn to protect the balance of the universe. It can be duplicated indefinitely, but will only grant its powers to the chosen one."
        },
        "treasure": {
            "name": "Dimension Stone",
            "description": [
                "[Infinity Blades] Mana cost is reduced by 1 and DMG is increased by 20%.",
                "[Infinity Blades] Mana cost is reduced by 1 and DMG is increased by 24%.",
                "[Infinity Blades] Mana cost is reduced by 1 and DMG is increased by 29%.",
                "[Infinity Blades] Mana cost is reduced by 1 and DMG is increased by 35%.",
                "[Infinity Blades] Mana cost is reduced by 1 and DMG is increased by 42%.",
                "[Infinity Blades] Mana cost is reduced by 1 and DMG is increased by 50%."
            ],
            "introduction": "A required item for wizards to go through dimensions. The Diamond stone is a magic stone that is loved by those who go through dimensions, and it contains unlimited energy. However, the power that one can use from it depends on the individual's ability. Only high ranking wizards can use it effectively."
        },
        "treasure-2": {
            "name": "Sword of Flow Cutting",
            "description": [
                "[Dimension Cleaver] DMG is increased by 50% and own Crit DMG is increased by 10% for 8 sec per each hit enemies. This effect can be stacked max 5 times.",
                "[Dimension Cleaver] DMG is increased by 50% and own Crit DMG is increased by 12% for 8 sec per each hit enemies. This effect can be stacked max 5 times.",
                "[Dimension Cleaver] DMG is increased by 50% and own Crit DMG is increased by 14% for 8 sec per each hit enemies. This effect can be stacked max 5 times.",
                "[Dimension Cleaver] DMG is increased by 50% and own Crit DMG is increased by 17% for 8 sec per each hit enemies. This effect can be stacked max 5 times.",
                "[Dimension Cleaver] DMG is increased by 50% and own Crit DMG is increased by 21% for 8 sec per each hit enemies. This effect can be stacked max 5 times.",
                "[Dimension Cleaver] DMG is increased by 50% and own Crit DMG is increased by 25% for 8 sec per each hit enemies. This effect can be stacked max 5 times."
            ],
            "introduction": "A legendary sword that has transcended eras.<br>A legendary sword that was made with the light of the sun and the melted souls of those in pain.<br>It is one of the required items for Dimension Cleaver since it is durable enough to withstand dimension and can be made very sharp."
        },
        "hasProfile": false
    },
    {
        "name": "Oddy",
        "class": "Mechanic",
        "weapon": {
            "name": "Moonshade Countdown, Tempodiana",
            "description": [
                "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 2 sec, and ATK is increased by 14% for 10 sec.",
                "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 3 sec, and ATK is increased by 17% for 10 sec.",
                "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 4 sec, and ATK is increased by 21% for 10 sec.",
                "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 5 sec, and ATK is increased by 25% for 10 sec.",
                "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 6 sec, and ATK is increased by 30% for 10 sec.",
                "Upon using Time Distortion, All allies' skill cooldown is reduced by extra 7 sec, and ATK is increased by 35% for 10 sec."
            ],
            "introduction": "After Oddy's watch was zapped with the Redpur curse and gained the power to control time over a living being, he used the infinite time he gained to research its possible applications. When he finally created a watch containing the essence of time magic after so many trails, Oddy found out that the secret of Redpur magics originated from moonlight and the shadow it creates. H named his masterpiece 'Tempodiana' and gave it the nickname 'Moonshade Countdown'."
        },
        "treasure": {
            "name": "Threads of Time",
            "description": [
                "[Time Distortion] DMG is increased by 20% and all allies' negative effects are dispelled.",
                "[Time Distortion] DMG is increased by 24% and all allies' negative effects are dispelled.",
                "[Time Distortion] DMG is increased by 29% and all allies' negative effects are dispelled.",
                "[Time Distortion] DMG is increased by 35% and all allies' negative effects are dispelled.",
                "[Time Distortion] DMG is increased by 42% and all allies' negative effects are dispelled.",
                "[Time Distortion] DMG is increased by 50% and all allies' negative effects are dispelled."
            ],
            "introduction": "Fur of the Red Fur Chief hung in the shadow of the moon. It is said that the mythical creature, the Red Fur Chief, uses the shadow of the moon during full moon to go through dimensions and dance. The Red Fur Chief dances until the shadow of the moon disappears, and it said that his tail sometimes gets stuck in the pathway. The fur of the colorful mythical creature gets stuck in the rift of time and space and stops time temporarily. Oddy uses the fur from the traces of the shadows of the moon to make a skein and uses it effectively for Time Distortion."
        },
        "treasure-2": {
            "name": "Fragment Collection",
            "description": [
                "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 20%.",
                "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 24%.",
                "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 29%.",
                "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 35%.",
                "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 42%.",
                "[Time Fragments] Has a 25% chance to reset Cooldown and increases DMG by 50%."
            ],
            "introduction": "Time Fragments that fell from the shadows of the moon.<br>Sometimes, Time Fragments fall from another dimension from the effect of the shadow of the moon that appears when using time magic.<br>The Time Fragments are small, but when gatherd, they become a giant Fragment Collection of records, which give ceaseless inspiration to the caster."
        },
        "hasProfile": false
    },
    {
        "name": "Pavel",
        "class": "Wizard",
        "weapon": {
            "name": "Dragon Hearts, Andarta Andraste",
            "description": [
                "Every 15 sec, deals 160% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
                "Every 14 sec, deals 192% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
                "Every 12.5 sec, deals 228% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
                "Every 11 sec, deals 276% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
                "Every 9.5 sec, deals 332% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec.",
                "Every 8 sec, deals 400% of ATK as M.DMG to 2 random enemies and inflicts Frost. Enemies already inflicted with Frost will become inflicted with Freeze for 5 sec."
            ],
            "introduction": "Andarta and Andraste were two dragons who were defeated by the demons during the war. They were a pair connected at the soul. They were lovers who understood each other better than anyone. Even as they lay dying, they refused to stay apart, and made one final request to Pavel, their comrade. Pavel granted their final wish by transferring their souls into their hearts, and then turning them into a pair of gems. Even though the two have lost their bodies, they remain together, and as inseparable as ever."
        },
        "treasure": {
            "name": "Glacial Heart",
            "description": [
                "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1 sec.",
                "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1.2 sec.",
                "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1.4 sec.",
                "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 1.7 sec.",
                "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 2.1 sec.",
                "[Icy Conquest] DMG is increased by 50% and Freeze duration is increased by 2.5 sec."
            ],
            "introduction": "Frozen blood of the winter spirit. Pavel found it deep inside the ice cave and made it into earrings. A harsh chill and severe pain can be felt from it, but it increases Pavel's mana to its limit."
        },
        "treasure-2": {
            "name": "Frozen Brooch",
            "description": [
                "[Ice Spear] Reduces Cooldown by 8% and has a 40% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
                "[Ice Spear] Reduces Cooldown by 8% and has a 48% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
                "[Ice Spear] Reduces Cooldown by 8% and has a 58% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
                "[Ice Spear] Reduces Cooldown by 8% and has a 70% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
                "[Ice Spear] Reduces Cooldown by 8% and has a 84% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears.",
                "[Ice Spear] Reduces Cooldown by 8% and has a 100% chance to freeze the enemy for 1 sec upon damaging the enemy in Frost state. This effect is not applied to additionally created spears."
            ],
            "introduction": "The dragon of ice gifted this brooch to a young Pavel, and imbued it with its breath.<br>But after the dragon of ice and Pavel became one, it reminds Pavel to not leave him. It can inflict pain that pierces the heart.<br>Imbues a chill to Pavel's mana, making his magic even sharper."
        },
        "hasProfile": false
    },
    {
        "name": "Phillop",
        "class": "Knight",
        "weapon": {
            "name": "Dragon's Ruins, Atein",
            "description": [
                "Upon receiving DMG, stacks Dragon Rage for 10 sec. Per each stacked Dragon Rage, ATK and DEF are increased by 0.8%. Can be stacked up to 100 times max.",
                "Upon receiving DMG, stacks Dragon Rage for 10 sec. Per each stacked Dragon Rage, ATK and DEF are increased by 1%. Can be stacked up to 100 times max.",
                "Upon receiving DMG, stacks Dragon Rage for 10 sec. Per each stacked Dragon Rage, ATK and DEF are increased by 1.2%. Can be stacked up to 100 times max.",
                "Upon receiving DMG, stacks Dragon Rage for 10 sec. Per each stacked Dragon Rage, ATK and DEF are increased by 1.4%. Can be stacked up to 100 times max.",
                "Upon receiving DMG, stacks Dragon Rage for 10 sec. Per each stacked Dragon Rage, ATK and DEF are increased by 1.7%. Can be stacked up to 100 times max.",
                "Upon receiving DMG, stacks Dragon Rage for 10 sec. Per each stacked Dragon Rage, ATK and DEF are increased by 2%. Can be stacked up to 100 times max."
            ],
            "introduction": "The Dark Dragons are Demons created to slay the dragons, the arbitrator of this world. During the war 100 years ago, these Dark Dragons killed and devoured countless of dragons. A few of the surviving dragons have gone insane from the rage and shame, and they eventually turned into Mad Dragons. They are now nothing more than giant monsters powered by their destructive instincts. Phillop and his Dwarves have been hunting these Dark Dragons since the Demon War, gathering their remains to forge legendary items."
        },
        "treasure": {
            "name": "Dwarven Ceremonial Hammer",
            "description": [
                "[Earth Incarnate] For the duration of skill, ATK Spd and Crit chance is increased by 250, and DEF boost is increased by 20%.",
                "[Earth Incarnate] For the duration of skill, ATK Spd and Crit chance is increased by 250, and DEF boost is increased by 24%.",
                "[Earth Incarnate] For the duration of skill, ATK Spd and Crit chance is increased by 250, and DEF boost is increased by 29%.",
                "[Earth Incarnate] For the duration of skill, ATK Spd and Crit chance is increased by 250, and DEF boost is increased by 35%.",
                "[Earth Incarnate] For the duration of skill, ATK Spd and Crit chance is increased by 250, and DEF boost is increased by 42%.",
                "[Earth Incarnate] For the duration of skill, ATK Spd and Crit chance is increased by 250, and DEF boost is increased by 50%."
            ],
            "introduction": "A hammer that the ancient Dwarven King received as a gift from the Earth Elemental. It was a gift that the King received for saving the Gnome Kingdom from the attacks of the evil Earth Dragon Azi Dahaka. Upon using Earth Incarnate, this ceremonial hammer, imbued with the blessing of the spirit of the earth, increases DEF with the power of the earth's spirit, and grants immunity to HP recovery and CC."
        },
        "treasure-2": {
            "name": "Dwarfish Capricorn Helmet",
            "description": [
                "[Headbutt] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 200 for 10 sec.",
                "[Headbutt] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 240 for 10 sec.",
                "[Headbutt] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 290 for 10 sec.",
                "[Headbutt] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 350 for 10 sec.",
                "[Headbutt] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 420 for 10 sec.",
                "[Headbutt] Reduces Mana Cost by 1 and reduces P.Crit Resistance of the affected enemy by 500 for 10 sec."
            ],
            "introduction": "Ancient Dwarf King's capricorn helmet.<br>It is made from the gold of dragons that was obtained after defeating the greedy dark dragon Bokrug. The magnificent golden horn of the helmet is imbued with the dark dragon's magic that will slow down an enemy who is hit with Headbutt."
        },
        "hasProfile": false
    },
    {
        "name": "Priscilla",
        "class": "Warrior",
        "weapon": {
            "name": "Tumultuous Dance, Excilius",
            "description": [
                "When attacking the enemy with 'Vital Strike' or 'Turbulent Dance', per every hit enemy, corresponding skill's cooldown is reduced by 1 sec and ATK Spd is increased by 50 for 5 sec. ATK Spd boost can be stacked up to 10 times max.",
                "When attacking the enemy with 'Vital Strike' or 'Turbulent Dance', per every hit enemy, corresponding skill's cooldown is reduced by 1.2 sec and ATK Spd is increased by 50 for 5 sec. ATK Spd boost can be stacked up to 10 times max.",
                "When attacking the enemy with 'Vital Strike' or 'Turbulent Dance', per every hit enemy, corresponding skill's cooldown is reduced by 1.4 sec and ATK Spd is increased by 50 for 5 sec. ATK Spd boost can be stacked up to 10 times max.",
                "When attacking the enemy with 'Vital Strike' or 'Turbulent Dance', per every hit enemy, corresponding skill's cooldown is reduced by 1.7 sec and ATK Spd is increased by 50 for 5 sec. ATK Spd boost can be stacked up to 10 times max.",
                "When attacking the enemy with 'Vital Strike' or 'Turbulent Dance', per every hit enemy, corresponding skill's cooldown is reduced by 2 sec and ATK Spd is increased by 50 for 5 sec. ATK Spd boost can be stacked up to 10 times max.",
                "When attacking the enemy with 'Vital Strike' or 'Turbulent Dance', per every hit enemy, corresponding skill's cooldown is reduced by 2.5 sec and ATK Spd is increased by 50 for 5 sec. ATK Spd boost can be stacked up to 10 times max."
            ],
            "introduction": "During her military career, Priscilla felled countless enemies with her halberd. Although the halberd fell into a state of disrepair following her retirement, it was later resurrected as Excilius. This upgrade was a part of of the order sent to Annette to create Mahitra for Aisha. This razor-sharp and incredibly durable new weapon even has the magical power to draw its enemies in. Those who have seen Priscilla slaughtering her Demon foes using this halberd claim that it was like watching an unstoppable storm."
        },
        "treasure": {
            "name": "Magical Stone of Gravity",
            "description": [
                "[Turbulent Dance] DMG is increased by 20% and target is inflicted by Stun for 3 sec.",
                "[Turbulent Dance] DMG is increased by 24% and target is inflicted by Stun for 3 sec.",
                "[Turbulent Dance] DMG is increased by 29% and target is inflicted by Stun for 3 sec.",
                "[Turbulent Dance] DMG is increased by 35% and target is inflicted by Stun for 3 sec.",
                "[Turbulent Dance] DMG is increased by 42% and target is inflicted by Stun for 3 sec.",
                "[Turbulent Dance] DMG is increased by 50% and target is inflicted by Stun for 3 sec."
            ],
            "introduction": "The first magic tool made by a wizard of Purple. The first gift that Aisha gave. Aisha created this magic tool because she felt bad that Priscilla used up so much power when using Turbulent Dance. The Mana Stone of Gravity relieves the pressure from the body when using Turbulent Dance, and it increases its effect."
        },
        "treasure-2": {
            "name": "Fancy Tea Set",
            "description": [
                "[Coordination] Increases ATK Boost by 20% and reduces Cooldown of the Hero with the highest ATK by 30%.",
                "[Coordination] Increases ATK Boost by 24% and reduces Cooldown of the Hero with the highest ATK by 30%.",
                "[Coordination] Increases ATK Boost by 29% and reduces Cooldown of the Hero with the highest ATK by 30%.",
                "[Coordination] Increases ATK Boost by 35% and reduces Cooldown of the Hero with the highest ATK by 30%.",
                "[Coordination] Increases ATK Boost by 42% and reduces Cooldown of the Hero with the highest ATK by 30%.",
                "[Coordination] Increases ATK Boost by 50% and reduces Cooldown of the Hero with the highest ATK by 30%."
            ],
            "introduction": "Aisha's favorite ceramic tea cups that Priscilla has ready at all times.<br>Luxurious tea cups made from the best clay of the eastern continent across the sea. It's mostly used for tea time with Aisha, but it is also used when using Coordination with Priscilla."
        },
        "hasProfile": false
    },
    {
        "name": "Reina",
        "class": "Assassin",
        "weapon": {
            "name": "Lightning Flash, Livatis",
            "description": [
                "Upon a Crit Hit, ATK Spd is increased by 80 and Crit DMG is increased by 20% for 15 sec. Can be stacked up to 5 times max.",
                "Upon a Crit Hit, ATK Spd is increased by 90 and Crit DMG is increased by 24% for 15 sec. Can be stacked up to 5 times max.",
                "Upon a Crit Hit, ATK Spd is increased by 110 and Crit DMG is increased by 28% for 15 sec. Can be stacked up to 5 times max.",
                "Upon a Crit Hit, ATK Spd is increased by 130 and Crit DMG is increased by 34% for 15 sec. Can be stacked up to 5 times max.",
                "Upon a Crit Hit, ATK Spd is increased by 160 and Crit DMG is increased by 41% for 15 sec. Can be stacked up to 5 times max.",
                "Upon a Crit Hit, ATK Spd is increased by 200 and Crit DMG is increased by 50% for 15 sec. Can be stacked up to 5 times max."
            ],
            "introduction": "The Stein family boasts a long lineage that dates back to the early days of the empire. The honor of the family, however, stems from the skills of its warriors, not its noble bloodline. Aria Stein was a legendary master of the blade. Remembered as one of the most skilled warriors in the history of the empire, she laid the foundation of the Stein family honor. Reina is her descendant. Aria's sword, Livatis, currently belongs to Reina. Light as a feather yet strong enough to withstand any strike, this sword helped Reina earn the nickname 'Flash'."
        },
        "treasure": {
            "name": "Medal of Swiftness",
            "description": [
                "[Shooting Star] DMG is increased by 20% and upon Crit Hit, mana is recovered by 200.",
                "[Shooting Star] DMG is increased by 24% and upon Crit Hit, mana is recovered by 200.",
                "[Shooting Star] DMG is increased by 29% and upon Crit Hit, mana is recovered by 200.",
                "[Shooting Star] DMG is increased by 35% and upon Crit Hit, mana is recovered by 200.",
                "[Shooting Star] DMG is increased by 42% and upon Crit Hit, mana is recovered by 200.",
                "[Shooting Star] DMG is increased by 50% and upon Crit Hit, mana is recovered by 200."
            ],
            "introduction": "A honorable medal given to the fastest mercenary. It's said to be a keepsake from Herz, the fastest warrior in the world. Wearing this medal will make the bearer's body feel lighter, and they'll be able to predict the opponent's movements."
        },
        "treasure-2": {
            "name": "Master's Ring",
            "description": [
                "[Sharp End] Increases ATK Boost by 50% and recovers additional 40 MP upon a Crit Hit for the skill's duration.",
                "[Sharp End] Increases ATK Boost by 50% and recovers additional 48 MP upon a Crit Hit for the skill's duration.",
                "[Sharp End] Increases ATK Boost by 50% and recovers additional 58 MP upon a Crit Hit for the skill's duration.",
                "[Sharp End] Increases ATK Boost by 50% and recovers additional 70 MP upon a Crit Hit for the skill's duration.",
                "[Sharp End] Increases ATK Boost by 50% and recovers additional 84 MP upon a Crit Hit for the skill's duration.",
                "[Sharp End] Increases ATK Boost by 50% and recovers additional 100 MP upon a Crit Hit for the skill's duration."
            ],
            "introduction": "The ring that Reina received after defeating her master. It's too big, so she wears it on her thumb.<br>It looks simple and ungainly, but the spirit of fighting is hidden within the rune letters engraved in the ring.<br>Staring at the ring of her master makes her feel like she will be getting more work today."
        },
        "hasProfile": false
    },
    {
        "name": "Rephy",
        "class": "Priest",
        "weapon": {
            "name": "God's Lamp, Kurulati",
            "description": [
                "Every 20 sec, an ally with the lowest HP turns invisible for 5 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1 %. MP Recovery per sec is increased to 120%.",
                "Every 20 sec, an ally with the lowest HP turns invisible for 6 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1 %. MP Recovery per sec is increased to 144%.",
                "Every 20 sec, an ally with the lowest HP turns invisible for 7 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1 %. MP Recovery per sec is increased to 172%.",
                "Every 20 sec, an ally with the lowest HP turns invisible for 8 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1 %. MP Recovery per sec is increased to 207%.",
                "Every 20 sec, an ally with the lowest HP turns invisible for 9 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1 %. MP Recovery per sec is increased to 248%.",
                "Every 20 sec, an ally with the lowest HP turns invisible for 10 sec. An invisible ally becomes immune to P.DMG, and HP will not drop below 1 %. MP Recovery per sec is increased to 300%."
            ],
            "introduction": "It is the duty of a soul guide to lead the lost souls into the right path, to help them move on to the next life. This lamp, powered by a mysterious orb created a long time ago by a dragon from a distant land, is a treasure of the Tamians. The orb at its core allows nearby souls to materialize, making it possible for its wielder to talk to them directly. As such, it is the ultimate medium for a soul guide. Tamian chieftains have used this relic to carry out the sacred duties of a soul guide for generations. Now, in the face of a great danger that threatens the world, the lamp has been passed on to Rephy, the most powerful soul guide in existence."
        },
        "treasure": {
            "name": "Haven of Souls",
            "description": [
                "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 8% of DMG.",
                "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 10% of DMG.",
                "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 12% of DMG.",
                "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 14% of DMG.",
                "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 17% of DMG.",
                "[Soulrush] Mana cost is reduced by 1 and heals all allies' HP by 20% of DMG."
            ],
            "introduction": "An ornament that was used for the memorial ceremonies of deceased royalty in ancient times. Inside the green jewel, there's a crystallized tear of the mythical creature that leads people to death. It's used as a resting places to comfort the emptiness within souls."
        },
        "treasure-2": {
            "name": "Seed of Birth",
            "description": [
                "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 12%.",
                "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 14%.",
                "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 17%.",
                "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 21%.",
                "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 25%.",
                "[Salvation] Increases M.DEF Boost by 50% and reduces Cooldown by 30%."
            ],
            "introduction": "A collection of the energy that is created when a life is born. It's very warm and gentle, so souls like it. Rephy uses it to start a fire in a lamp to borrow the power of the souls. When a seed is put in a lamp, it shines brightly, like when the sun was first born."
        },
        "hasProfile": false
    },
    {
        "name": "Ricardo",
        "class": "Knight",
        "weapon": {
            "name": "Light of Judgment, Theoria",
            "description": [
                "When allies excluding self take DMG, there is a 10% chance to turn 320% of ATK as a shield for 5 sec. This effect is activated once every 5 sec.",
                "When allies excluding self take DMG, there is a 12% chance to turn 384% of ATK as a shield for 5 sec. This effect is activated once every 5 sec.",
                "When allies excluding self take DMG, there is a 14% chance to turn 460% of ATK as a shield for 5 sec. This effect is activated once every 5 sec.",
                "When allies excluding self take DMG, there is a 17% chance to turn 552% of ATK as a shield for 5 sec. This effect is activated once every 5 sec.",
                "When allies excluding self take DMG, there is a 20% chance to turn 660% of ATK as a shield for 5 sec. This effect is activated once every 5 sec.",
                "When allies excluding self take DMG, there is a 25% chance to turn 800% of ATK as a shield for 5 sec. This effect is activated once every 5 sec."
            ],
            "introduction": "When the Holy Sword Aea was bestowed upon Kyle, it appeared in the Temple of Lua located north of the King's Plains. When Kyle removed the sword from the altar, it released a powerful wave of light that turned the entire vicinity into a sacred ground. Everything contained within the Temple was turned into holy relics. Theoria, the central pillar of the Temple, absorbed the greatest amount of holy energy of them all."
        },
        "treasure": {
            "name": "Templar Vow",
            "description": [
                "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 100 for 10 sec.",
                "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 120 for 10 sec.",
                "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 140 for 10 sec.",
                "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 170 for 10 sec.",
                "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 210 for 10 sec.",
                "[Divine Judgment] dispels enemies' positive effects with 75% chance, and reduces target's ATK Spd by 250 for 10 sec."
            ],
            "introduction": "The seal that Ricardo used for the pledge of the Holy Warrior. When first appointed as a Holy Warrior, knights leave their names on the certificate of oath with their seals. Ricardo made his seal with his affection for the Church of Lua.<br>He still carries it now, after all this time."
        },
        "treasure-2": {
            "name": "Pride of Holy Warrior",
            "description": [
                "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 10% for the skill's duration.",
                "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 12% for the skill's duration.",
                "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 14% for the skill's duration.",
                "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 17% for the skill's duration.",
                "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 21% for the skill's duration.",
                "[Divine Protection] Gains Immunity to CC and increases M.Resistance by 25% for the skill's duration."
            ],
            "introduction": "Shield of the arbiter of Lua's Holy Knights.<br>Artifact given to those who've earned the title of Arbiter from the Lua's Holy Knights.<br>An artifact imbued with Goddess Lua's blessing, it protects those under the benevolence of the god, and punishes enemies without mercy."
        },
        "hasProfile": false
    },
    {
        "name": "Rodina",
        "class": "Mechanic",
        "weapon": {
            "name": "Rodina Custom Rifle Mod.0",
            "description": [
                "Each attack has a 20% chance of dealing 200% of ATK as extra P.DMG and knocking back the enemy. Afterwards, ACC is increased by 100 for 10 sec. This effect can be stacked up to 3 times max.",
                "Each attack has a 20% chance of dealing 240% of ATK as extra P.DMG and knocking back the enemy. Afterwards, ACC is increased by 100 for 10 sec. This effect can be stacked up to 3 times max.",
                "Each attack has a 20% chance of dealing 288% of ATK as extra P.DMG and knocking back the enemy. Afterwards, ACC is increased by 100 for 10 sec. This effect can be stacked up to 3 times max.",
                "Each attack has a 20% chance of dealing 344% of ATK as extra P.DMG and knocking back the enemy. Afterwards, ACC is increased by 100 for 10 sec. This effect can be stacked up to 3 times max.",
                "Each attack has a 20% chance of dealing 414% of ATK as extra P.DMG and knocking back the enemy. Afterwards, ACC is increased by 100 for 10 sec. This effect can be stacked up to 3 times max.",
                "Each attack has a 20% chance of dealing 500% of ATK as extra P.DMG and knocking back the enemy. Afterwards, ACC is increased by 100 for 10 sec. This effect can be stacked up to 3 times max."
            ],
            "introduction": "The essence of the most sophisticated imperial technology. Requiring superhuman precision, this rifle cannot be handled by a regular person. It has been magically enhanced to allow the shooter to see impossibly long distances. Even the greatest scope in the world, however, is useless in the hands of someone who can't aim with it. As such, the performance of this rifle has significantly depended on the skills of its users. Rodina, gifted with superb vision and precise control, is a suitable owner of this rifle. She went one step further and customized it to her preference, naming it Rodina Custom."
        },
        "treasure": {
            "name": "Custom Bullet VII",
            "description": [
                "[Focused Fire] Increases DMG by 20% and inflicts damage ignoring the target's DEF with the last 2 shots.",
                "[Focused Fire] Increases DMG by 24% and inflicts damage ignoring the target's DEF with the last 2 shots.",
                "[Focused Fire] Increases DMG by 29% and inflicts damage ignoring the target's DEF with the last 2 shots.",
                "[Focused Fire] Increases DMG by 35% and inflicts damage ignoring the target's DEF with the last 2 shots.",
                "[Focused Fire] Increases DMG by 42% and inflicts damage ignoring the target's DEF with the last 2 shots.",
                "[Focused Fire] Increases DMG by 50% and inflicts damage ignoring the target's DEF with the last 2 shots."
            ],
            "introduction": "A barrage that was requested to the legendary blacksmith of the empire. It contains gunpowder made from the sturdy egg of a pitta and the jaw bone of a dragon turtle. It was made small so that Rodina can use it easily, but it has the power to destroy anything."
        },
        "treasure-2": {
            "name": "Crystal Support",
            "description": [
                "[Target Aim] Changes the target to a random enemy when Rodina's target dies, increasing ATK by 20% for 10 sec.",
                "[Target Aim] Changes the target to a random enemy when Rodina's target dies, increasing ATK by 24% for 10 sec.",
                "[Target Aim] Changes the target to a random enemy when Rodina's target dies, increasing ATK by 29% for 10 sec.",
                "[Target Aim] Changes the target to a random enemy when Rodina's target dies, increasing ATK by 35% for 10 sec.",
                "[Target Aim] Changes the target to a random enemy when Rodina's target dies, increasing ATK by 42% for 10 sec.",
                "[Target Aim] Changes the target to a random enemy when Rodina's target dies, increasing ATK by 50% for 10 sec."
            ],
            "introduction": "A sniper rifle support that Pavel made so that it would fit Rodina's small body.<br>It's made of crystals so it's very firm and sturdy. This support is enough to aim at any target."
        },
        "hasProfile": false
    },
    {
        "name": "Scarlet",
        "class": "Warrior",
        "weapon": {
            "name": "Blade of Conviction, White Belona",
            "description": [
                "Per every skill in cooldown, DMG is increased by 8%.",
                "Per every skill in cooldown, DMG is increased by 10%.",
                "Per every skill in cooldown, DMG is increased by 12%.",
                "Per every skill in cooldown, DMG is increased by 14%.",
                "Per every skill in cooldown, DMG is increased by 17%.",
                "Per every skill in cooldown, DMG is increased by 20%."
            ],
            "introduction": "The most legendary sword in Orvelia. This sacred blade has been passed down the royal lineage of Orvelia since the kingdom's birth, symbolizing the true authority of the monarch. King Kyle used this sword as well, until he was chosen by the Holy Sword Aea. Blessed with the power of light, its blade can disable any magic by cutting through its flow. Only a knight of noble bloodline and righteous pride can wield this sword. Those who wish to lift it must pass the trial of the royal family, a feat only accomplished by Scarlet, aside from Kyle."
        },
        "treasure": {
            "name": "Pride of Orvelia",
            "description": [
                "[Sword of Honor!!] DMG is increased by 20% and each ATK inflicts Stun on enemy for 3 sec.",
                "[Sword of Honor!!] DMG is increased by 24% and each ATK inflicts Stun on enemy for 3 sec.",
                "[Sword of Honor!!] DMG is increased by 29% and each ATK inflicts Stun on enemy for 3 sec.",
                "[Sword of Honor!!] DMG is increased by 35% and each ATK inflicts Stun on enemy for 3 sec.",
                "[Sword of Honor!!] DMG is increased by 42% and each ATK inflicts Stun on enemy for 3 sec.",
                "[Sword of Honor!!] DMG is increased by 50% and each ATK inflicts Stun on enemy for 3 sec."
            ],
            "introduction": "A celebratory flag that was made to praise the king when Orvelia was first founded. Whenever she sees the flag in the office, it angers her to think of the treacherous subjects who reduced her father to a scarecrow and the flatterers who ruined the country. This made Scarlet even more determined to restore Orvelia's days of glory and to establish a stronger throne."
        },
        "treasure-2": {
            "name": "Wings of Justice",
            "description": [
                "[Justice Served!] Increases DMG by 20% and reduces Cooldown of all allies by 10%.",
                "[Justice Served!] Increases DMG by 24% and reduces Cooldown of all allies by 10%.",
                "[Justice Served!] Increases DMG by 29% and reduces Cooldown of all allies by 10%.",
                "[Justice Served!] Increases DMG by 35% and reduces Cooldown of all allies by 10%.",
                "[Justice Served!] Increases DMG by 42% and reduces Cooldown of all allies by 10%.",
                "[Justice Served!] Increases DMG by 50% and reduces Cooldown of all allies by 10%."
            ],
            "introduction": "Pendant made by Scarlet, whose principles won't let her ignore injustice or kneel in the face of cowardice. She gifted one each to the people she relies on: Clause and Demia.<br>The shining wings of the royal emerald, which symbolize justice, are embedded inside the pendant. One can straighten oneself out by staring at the pendant that reflects one's eyes. She looks at it each time she feels despair by looking at the people who lay blame on her father Veroglance II."
        },
        "hasProfile": false
    },
    {
        "name": "Selene",
        "class": "Archer",
        "weapon": {
            "name": "Green Winds, Notos",
            "description": [
                "Upon a Crit Hit, ATK Spd is increased by 200 for 10 sec, and for the duration of skill, each auto attack fires an arrow that deals extra 100% P.DMG.",
                "Upon a Crit Hit, ATK Spd is increased by 240 for 10 sec, and for the duration of skill, each auto attack fires an arrow that deals extra 120% P.DMG.",
                "Upon a Crit Hit, ATK Spd is increased by 280 for 10 sec, and for the duration of skill, each auto attack fires an arrow that deals extra 140% P.DMG.",
                "Upon a Crit Hit, ATK Spd is increased by 340 for 10 sec, and for the duration of skill, each auto attack fires an arrow that deals extra 170% P.DMG.",
                "Upon a Crit Hit, ATK Spd is increased by 410 for 10 sec, and for the duration of skill, each auto attack fires an arrow that deals extra 210% P.DMG.",
                "Upon a Crit Hit, ATK Spd is increased by 500 for 10 sec, and for the duration of skill, each auto attack fires an arrow that deals extra 250% P.DMG."
            ],
            "introduction": "A bow blessed with the breath of Sylph, the Wind Elemental. Only a person of noble character may wield it. When drawn, the bow nocks itself with a deadly magic arrow created from the breath of the Elemental. Guided by the Wind Elemental, the arrow never misses its target, no matter where it's hiding. Selene has shared special bonds with Elementals since childhood. She was specially close to Sylph, who enchanted her bow a as a sign of their friendship."
        },
        "treasure": {
            "name": "Silver Arrow",
            "description": [
                "[Moonlight Flash] DMG is increased by 20% and target takes 20% additional P.DMG for 10 sec.",
                "[Moonlight Flash] DMG is increased by 24% and target takes 20% additional P.DMG for 10 sec.",
                "[Moonlight Flash] DMG is increased by 29% and target takes 20% additional P.DMG for 10 sec.",
                "[Moonlight Flash] DMG is increased by 35% and target takes 20% additional P.DMG for 10 sec.",
                "[Moonlight Flash] DMG is increased by 42% and target takes 20% additional P.DMG for 10 sec.",
                "[Moonlight Flash] DMG is increased by 50% and target takes 20% additional P.DMG for 10 sec."
            ],
            "introduction": "Arrowhead imbued with the blessing of the Goddess of Hunting and the Moon. An ancient artifact that is passed down to the best Elven hunter. It is said that the Goddess of Hunting and the Moon cared for the Elves who protected the holy forest, and she lent her power to them through the artifact. The silver arrow imbued with the power of the Goddess of the Moon has a mysterious power that allows the user to his enemy and boost DMG."
        },
        "treasure-2": {
            "name": "Wind Spirit Seal Stone",
            "description": [
                "[Rush] Increases DMG by 20% and has a 15% chance to summon 1 Rush Arrow upon a normal attack.",
                "[Rush] Increases DMG by 24% and has a 15% chance to summon 1 Rush Arrow upon a normal attack.",
                "[Rush] Increases DMG by 29% and has a 15% chance to summon 1 Rush Arrow upon a normal attack.",
                "[Rush] Increases DMG by 35% and has a 15% chance to summon 1 Rush Arrow upon a normal attack.",
                "[Rush] Increases DMG by 42% and has a 15% chance to summon 1 Rush Arrow upon a normal attack.",
                "[Rush] Increases DMG by 50% and has a 15% chance to summon 1 Rush Arrow upon a normal attack."
            ],
            "introduction": "The violent Wind Bow Spirit is sealed within this stone.<br>Sealed stone containing the Wind Bow Spirit that was sealed by the Fairy King for causing all kinds of fights and pulling evil pranks.<br>The Wind Bow Spirit is thirsty for a fight and increases the killing rate of the bow of the archer that summoned him by  5 times or more."
        },
        "hasProfile": false
    },
    {
        "name": "Sonia",
        "class": "Knight",
        "weapon": {
            "name": "Eye of the Storm, Yanadis",
            "description": [
                "Shock duration is increased by 2 sec. When auto attacking an enemy inflicted by Shock, all cooldowns are reduced by 1.6%.",
                "Shock duration is increased by 3 sec. When auto attacking an enemy inflicted by Shock, all cooldowns are reduced by 1.9%.",
                "Shock duration is increased by 4 sec. When auto attacking an enemy inflicted by Shock, all cooldowns are reduced by 2.3%.",
                "Shock duration is increased by 5 sec. When auto attacking an enemy inflicted by Shock, all cooldowns are reduced by 2.7%.",
                "Shock duration is increased by 6 sec. When auto attacking an enemy inflicted by Shock, all cooldowns are reduced by 3.3%.",
                "Shock duration is increased by 7 sec. When auto attacking an enemy inflicted by Shock, all cooldowns are reduced by 4%."
            ],
            "introduction": "A sphere of electricity created by Sonia based on the beast core that is now her own heart. She has shown great talent in making magic gear, and this is the first weapon she ever created. it's a bit lacking in stability, mostly due to the overwhelming electricity it contains. The powerful electrical storm created by this weapon is truly dangerous for any enemy. In fact, anyone besides Sonia who touches it would be instantly fried by the immense current that flows through it."
        },
        "treasure": {
            "name": "Heart of Baikal",
            "description": [
                "[Electric Explosion!] When attacking enemy inflicted by Shock, enemy takes 100% of ATK as extra M.DMG and target's M.DEF and P.DEF is reduced by 10% for 5 sec.",
                "[Electric Explosion!] When attacking enemy inflicted by Shock, enemy takes 100% of ATK as extra M.DMG and target's M.DEF and P.DEF is reduced by 12% for 5 sec.",
                "[Electric Explosion!] When attacking enemy inflicted by Shock, enemy takes 100% of ATK as extra M.DMG and target's M.DEF and P.DEF is reduced by 14% for 5 sec.",
                "[Electric Explosion!] When attacking enemy inflicted by Shock, enemy takes 100% of ATK as extra M.DMG and target's M.DEF and P.DEF is reduced by 17% for 5 sec.",
                "[Electric Explosion!] When attacking enemy inflicted by Shock, enemy takes 100% of ATK as extra M.DMG and target's M.DEF and P.DEF is reduced by 21% for 5 sec.",
                "[Electric Explosion!] When attacking enemy inflicted by Shock, enemy takes 100% of ATK as extra M.DMG and target's M.DEF and P.DEF is reduced by 25% for 5 sec."
            ],
            "introduction": "Heart of Vikal, who is called a holy beast. He eats the enemies of light and dark from the world, so his heart is full of thunder from the collision between the two enemies. If someone unskilled were to touch it, he would be absorbed by its power. But Sonia, who is made up of the core of lighting, absorbed that power and obtained mana that is beyond imaginable."
        },
        "treasure-2": {
            "name": "Lightning Tent",
            "description": [
                "[Power of Lightning!] Changes the effect irremovable and increases the chance to trigger an additional damage by 10% additionally.",
                "[Power of Lightning!] Changes the effect irremovable and increases the chance to trigger an additional damage by 12% additionally.",
                "[Power of Lightning!] Changes the effect irremovable and increases the chance to trigger an additional damage by 14% additionally.",
                "[Power of Lightning!] Changes the effect irremovable and increases the chance to trigger an additional damage by 17% additionally.",
                "[Power of Lightning!] Changes the effect irremovable and increases the chance to trigger an additional damage by 21% additionally.",
                "[Power of Lightning!] Changes the effect irremovable and increases the chance to trigger an additional damage by 25% additionally."
            ],
            "introduction": "A cloak that Mirianne made for Sonia by braving a danger. There was a time when Sonia's clothes would burn from the explosion of the electriciy that ran through her body. Mirianne saw that and plucked out the ereth plant that is said to grow by being struck by lightning. She pulled out its thread and completed a cloak with it. Sonia saw Mirianne's blistered hands from the electricity, and she cried in silence for a long time. A piece of clothing just for Sonia that can't be found anywhere else."
        },
        "hasProfile": false
    },
    {
        "name": "Tanya",
        "class": "Assassin",
        "weapon": {
            "name": "Demon of the Calm, Caethasis",
            "description": [
                "Each auto attack has a 10% chance to deal 140% of ATK as extra P.DMG to target, and turns into Stealth mode for 10 sec. Cooldown is 10 sec.",
                "Each auto attack has a 12% chance to deal 170% of ATK as extra P.DMG to target, and turns into Stealth mode for 10 sec. Cooldown is 10 sec.",
                "Each auto attack has a 14% chance to deal 200% of ATK as extra P.DMG to target, and turns into Stealth mode for 10 sec. Cooldown is 10 sec.",
                "Each auto attack has a 17% chance to deal 240% of ATK as extra P.DMG to target, and turns into Stealth mode for 10 sec. Cooldown is 10 sec.",
                "Each auto attack has a 20% chance to deal 290% of ATK as extra P.DMG to target, and turns into Stealth mode for 10 sec. Cooldown is 10 sec.",
                "Each auto attack has a 25% chance to deal 350% of ATK as extra P.DMG to target, and turns into Stealth mode for 10 sec. Cooldown is 10 sec."
            ],
            "introduction": "The Demon War dates back to 100 years ago. During this war, the greatest threat to mankind was, without a doubt, the high-ranking Demon officers. Kaitasis, the Demon of the Calm, was especially dangerous among them. Countless wizards and priests were slaughtered by this Demon who specifically targeted magic users for their souls. Eventually, Kaitasis was defeated by Kyle, and its core came into the possession of the Laughing Mask and it once again served as an instrument of Death."
        },
        "treasure": {
            "name": "Dagger of Silence",
            "description": [
                "[Whisper of Death] DMG is increased by 20% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
                "[Whisper of Death] DMG is increased by 24% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
                "[Whisper of Death] DMG is increased by 29% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
                "[Whisper of Death] DMG is increased by 35% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
                "[Whisper of Death] DMG is increased by 42% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec.",
                "[Whisper of Death] DMG is increased by 50% and upon use, immediately gains Stealth. If used in Stealth mode, ATK is increased by 20% for 10 sec."
            ],
            "introduction": "A dagger given to those who complete the first mission of the Laughing Mask. There's a rule that says that assassins should always carry the dagger that has traces of their target. The silent dagger that assassins carry like an amulet consistently whispers to them about death."
        },
        "treasure-2": {
            "name": "Laughing Mask All-round Belt",
            "description": [
                "[Blade Tornado] Increases DMG by 20% and reduces Cooldown by 8% upon a Crit Hit.",
                "[Blade Tornado] Increases DMG by 24% and reduces Cooldown by 8% upon a Crit Hit.",
                "[Blade Tornado] Increases DMG by 29% and reduces Cooldown by 8% upon a Crit Hit.",
                "[Blade Tornado] Increases DMG by 35% and reduces Cooldown by 8% upon a Crit Hit.",
                "[Blade Tornado] Increases DMG by 42% and reduces Cooldown by 8% upon a Crit Hit.",
                "[Blade Tornado] Increases DMG by 50% and reduces Cooldown by 8% upon a Crit Hit."
            ],
            "introduction": "Multi-purpose tool of the Laughing Mask used for assassination.<br>Unique item of the Laughing Mask that gets rid of the target fast and accurately.<br>Even at the moment of Blade Tornado, it allows for an attack to be continued and is optimized for the wearer's attack patterns."
        },
        "hasProfile": false
    },
    {
        "name": "Theo",
        "class": "Warrior",
        "weapon": {
            "name": "Lightning Bolt, Legios",
            "description": [
                "Each auto attack and skill attack stacks 'Lightning' on self. Upon the 50th stack, 'Lightning Bolt, Legios' activates, and for 10 sec, ATK Spd is increased by 300, Crit DMG is increased by 100%, and Penetration is increased by 300. While 'Lightning Bolt, Legios' is activated, Lightning will not stack. This effect cannot be dispelled.",
                "Each auto attack and skill attack stacks 'Lightning' on self. Upon the 50th stack, 'Lightning Bolt, Legios' activates, and for 10 sec, ATK Spd is increased by 360, Crit DMG is increased by 120%, and Penetration is increased by 360. While 'Lightning Bolt, Legios' is activated, Lightning will not stack. This effect cannot be dispelled.",
                "Each auto attack and skill attack stacks 'Lightning' on self. Upon the 50th stack, 'Lightning Bolt, Legios' activates, and for 10 sec, ATK Spd is increased by 430, Crit DMG is increased by 144%, and Penetration is increased by 430. While 'Lightning Bolt, Legios' is activated, Lightning will not stack. This effect cannot be dispelled.",
                "Each auto attack and skill attack stacks 'Lightning' on self. Upon the 50th stack, 'Lightning Bolt, Legios' activates, and for 10 sec, ATK Spd is increased by 520, Crit DMG is increased by 173%, and Penetration is increased by 520. While 'Lightning Bolt, Legios' is activated, Lightning will not stack. This effect cannot be dispelled.",
                "Each auto attack and skill attack stacks 'Lightning' on self. Upon the 50th stack, 'Lightning Bolt, Legios' activates, and for 10 sec, ATK Spd is increased by 620, Crit DMG is increased by 208%, and Penetration is increased by 620. While 'Lightning Bolt, Legios' is activated, Lightning will not stack. This effect cannot be dispelled.",
                "Each auto attack and skill attack stacks 'Lightning' on self. Upon the 50th stack, 'Lightning Bolt, Legios' activates, and for 10 sec, ATK Spd is increased by 750, Crit DMG is increased by 250%, and Penetration is increased by 750. While 'Lightning Bolt, Legios' is activated, Lightning will not stack. This effect cannot be dispelled."
            ],
            "introduction": "A spear said to to have been forged from a bolt of lightning. Electricity constantly flows around this impressive spear that stands as tall as an average adult male. Forging a spear from lightning was a tremendous task. But then again, Jin was no ordinary blacksmith. He smelted a huge mana stone infused with a red dragon's blood. He used this to contain the lightning before forging it into a spear. Aside from its chosen master, no person can touch this weapon. When its two pieces are combined, it lets out a tremendous flux of energy that resembles a dragon's roar."
        },
        "treasure": {
            "name": "Essence of Red Lightning",
            "description": [
                "[Lightning Explosion] Skill cooldown is reduced by 30% and upon attack, deals 40% of ATK as extra M.DMG.",
                "[Lightning Explosion] Skill cooldown is reduced by 30% and upon attack, deals 48% of ATK as extra M.DMG.",
                "[Lightning Explosion] Skill cooldown is reduced by 30% and upon attack, deals 58% of ATK as extra M.DMG.",
                "[Lightning Explosion] Skill cooldown is reduced by 30% and upon attack, deals 70% of ATK as extra M.DMG.",
                "[Lightning Explosion] Skill cooldown is reduced by 30% and upon attack, deals 84% of ATK as extra M.DMG.",
                "[Lightning Explosion] Skill cooldown is reduced by 30% and upon attack, deals 100% of ATK as extra M.DMG."
            ],
            "introduction": "Legacy of the fallen Republic of Grey. A treasure that a respected palace wizard of the Republic of Grey gave to the 1st knight Theo, who received the Lightning Bolt Legios. The Lightning Bolt maximizes the effect of Lightning Explosion."
        },
        "treasure-2": {
            "name": "God of Lightning's Necklace",
            "description": [
                "[God of Lightning] ATK Spd is increased by 250 for the duration of skill, and the activation chance of 'For Jane' is increased by an additional 8%.",
                "[God of Lightning] ATK Spd is increased by 250 for the duration of skill, and the activation chance of 'For Jane' is increased by an additional 9.6%.",
                "[God of Lightning] ATK Spd is increased by 250 for the duration of skill, and the activation chance of 'For Jane' is increased by an additional 11.5%.",
                "[God of Lightning] ATK Spd is increased by 250 for the duration of skill, and the activation chance of 'For Jane' is increased by an additional 13.8%.",
                "[God of Lightning] ATK Spd is increased by 250 for the duration of skill, and the activation chance of 'For Jane' is increased by an additional 16.5%.",
                "[God of Lightning] ATK Spd is increased by 250 for the duration of skill, and the activation chance of 'For Jane' is increased by an additional 20%."
            ],
            "introduction": "Called a thunderbolt from the sky. Legios is also called a holy beast.<br>The power of Legios was so strong that when they made it into a weapon, the Republic of Gray couldn't contain all of its power.<br>So the greatest piece was put in the Spear of Lightning, and the remaining pieces were put into different places.<br>One of those pieces was put into God of Lightning's Necklace. It is said that anyone with this necklace can commune with the Spear of Lightning and get closer to the power of Legios."
        },
        "hasProfile": false
    },
    {
        "name": "Viska",
        "class": "Warrior",
        "weapon": {
            "name": "Nightmare Fang, Kitrax",
            "description": [
                "Enemies that had their Souls stolen take 25% increased M.DMG. Lasts for 10 sec.",
                "Enemies that had their Souls stolen take 30% increased M.DMG. Lasts for 10 sec.",
                "Enemies that had their Souls stolen take 36% increased M.DMG. Lasts for 10 sec.",
                "Enemies that had their Souls stolen take 43% increased M.DMG. Lasts for 10 sec.",
                "Enemies that had their Souls stolen take 51% increased M.DMG. Lasts for 10 sec.",
                "Enemies that had their Souls stolen take 60% increased M.DMG. Lasts for 10 sec."
            ],
            "introduction": "Nightmare Kitrax was known as the best, and the most terrifying, of the succubi. After devouring Kitrax whole, soul and all, Viska came up with her most powerful weapon yet. This spike is the physical manifestation of fear and despair. Death is the only fate of its unfortunate victims. It constantly injects fear into its victim's soul, reducing even the most formidable enemy to mere prey."
        },
        "treasure": {
            "name": "Soul of a Giant Demon",
            "description": [
                "[I'll rip you to pieces!!] Gain immunity to CC during skill activation and upon every use, DMG is increased by 4%. This effect is stacked max 10 times.",
                "[I'll rip you to pieces!!] Gain immunity to CC during skill activation and upon every use, DMG is increased by 4.8%. This effect is stacked max 10 times.",
                "[I'll rip you to pieces!!] Gain immunity to CC during skill activation and upon every use, DMG is increased by 5.8%. This effect is stacked max 10 times.",
                "[I'll rip you to pieces!!] Gain immunity to CC during skill activation and upon every use, DMG is increased by 7%. This effect is stacked max 10 times.",
                "[I'll rip you to pieces!!] Gain immunity to CC during skill activation and upon every use, DMG is increased by 8.4%. This effect is stacked max 10 times.",
                "[I'll rip you to pieces!!] Gain immunity to CC during skill activation and upon every use, DMG is increased by 10%. This effect is stacked max 10 times."
            ],
            "introduction": "Crystallized form of great demon Curapi's soul, who has the power to get big. He was one of the first demons that Viska hunted in the Demon world, and it is said that it used its big body to dominate his enemies. But battle isn't all about strength, but using one's brain as well. The giant demon was defeated and eaten by a predator who used her brain. The power to get big became Viska's , and she can use it freely now."
        },
        "treasure-2": {
            "name": "Rampaging Beast's Claw",
            "description": [
                "[I'll Slice You Up!] Reduces Cooldown by 30% and adds 8% M.DEF reduction.",
                "[I'll Slice You Up!] Reduces Cooldown by 30% and adds 10% M.DEF reduction.",
                "[I'll Slice You Up!] Reduces Cooldown by 30% and adds 12% M.DEF reduction.",
                "[I'll Slice You Up!] Reduces Cooldown by 30% and adds 14% M.DEF reduction.",
                "[I'll Slice You Up!] Reduces Cooldown by 30% and adds 17% M.DEF reduction.",
                "[I'll Slice You Up!] Reduces Cooldown by 30% and adds 20% M.DEF reduction."
            ],
            "introduction": "Claw of the violent magic beast Urgol, who is said to bite off souls.<br>The day Viska decided to hunt in the Material World, she devoured Urgol from the Demon World.<br>Combined with the ability that Viska has to absorb the power of others, it displayed great power, and it is essential to eat Demons who trespassed to the Material World."
        },
        "hasProfile": false
    },
    {
        "name": "Yanne",
        "class": "Archer",
        "weapon": {
            "name": "Dragonbane, Svelta",
            "description": [
                "Upon a Crit Hit, there is a 10% chance of dealing 200% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
                "Upon a Crit Hit, there is a 12% chance of dealing 240% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
                "Upon a Crit Hit, there is a 14% chance of dealing 290% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
                "Upon a Crit Hit, there is a 17% chance of dealing 350% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
                "Upon a Crit Hit, there is a 21% chance of dealing 420% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec.",
                "Upon a Crit Hit, there is a 25% chance of dealing 500% of ATK as P.DMG, and recovering 5% of Mana. If the target is a Dragon, inflicts Stun for 1.5 sec."
            ],
            "introduction": "An enchanted weapon made from the bones, tendons, and pieces of hide the Mad Dragon Svelta. Too heavy for a normal human to even lift, let alone draw, this monstrous greatbow is a combination of the siege weapon technologies from the Dark Elves and Dwarves. Only those with incredible muscular strength such as Yanne can hope to handle this ridiculous bow. The Mad Dragon's soul still remains in this bow. Her ferocious energy rides on every arrow it fires, granting it the power to shatter through even the mightiest of walls."
        },
        "treasure": {
            "name": "Dragon Steak",
            "description": [
                "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 10% for the skill's duration.",
                "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 12% for the skill's duration.",
                "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 14% for the skill's duration.",
                "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 17% for the skill's duration.",
                "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 21% for the skill's duration.",
                "[No Holding Back!] Reduces Mana Cost by 1 and increases DMG to Dragons by 25% for the skill's duration."
            ],
            "introduction": "T-bone steak from which you can taste a dragon's sirloin and tenderloin at the same time. The taste is truly wonderful. The dragon's holy energy enters the body, and increases Yanne's battle stamina to the max."
        },
        "treasure-2": {
            "name": "Giant Arrow of Sudden Death",
            "description": [
                "[Wipeout!] Increases DMG by 20% and reduces Cooldown by 12% upon a Crit Hit",
                "[Wipeout!] Increases DMG by 24% and reduces Cooldown by 12% upon a Crit Hit",
                "[Wipeout!] Increases DMG by 29% and reduces Cooldown by 12% upon a Crit Hit",
                "[Wipeout!] Increases DMG by 35% and reduces Cooldown by 12% upon a Crit Hit",
                "[Wipeout!] Increases DMG by 42% and reduces Cooldown by 12% upon a Crit Hit",
                "[Wipeout!] Increases DMG by 50% and reduces Cooldown by 12% upon a Crit Hit"
            ],
            "introduction": "An arrow made from Mad Dragon Svelta's spine, who spews out powerful magic cannons. It's Yanne's loot. The arrowhead has the Mad Dragon's burning red eye. It's still imbued with its madness, always ready to burn the enemy."
        },
        "hasProfile": false
    },
    {
        "name": "Crow",
        "class": "Mechanic",
        "weapon": {
            "name": "Hellhound, Akistra",
            "description": [
                "The normal attack shoots an additional bullet that deals 50% of ATK as P.DMG. When the skill ends, 'Hellhound, Akistra' is activated, increasing ATK by 30% and Crit DMG by 30% for 10 sec. 'Hellhound, Akistra' is only activated once at 20 sec.",
                "The normal attack shoots an additional bullet that deals 60% of ATK as P.DMG. When the skill ends, 'Hellhound, Akistra' is activated, increasing ATK by 36% and Crit DMG by 36% for 10 sec. 'Hellhound, Akistra' is only activated once at 20 sec.",
                "The normal attack shoots an additional bullet that deals 70% of ATK as P.DMG. When the skill ends, 'Hellhound, Akistra' is activated, increasing ATK by 43% and Crit DMG by 43% for 10 sec. 'Hellhound, Akistra' is only activated once at 20 sec.",
                "The normal attack shoots an additional bullet that deals 85% of ATK as P.DMG. When the skill ends, 'Hellhound, Akistra' is activated, increasing ATK by 52% and Crit DMG by 52% for 10 sec. 'Hellhound, Akistra' is only activated once at 20 sec.",
                "The normal attack shoots an additional bullet that deals 100% of ATK as P.DMG. When the skill ends, 'Hellhound, Akistra' is activated, increasing ATK by 62% and Crit DMG by 62% for 10 sec. 'Hellhound, Akistra' is only activated once at 20 sec.",
                "The normal attack shoots an additional bullet that deals 125% of ATK as P.DMG. When the skill ends, 'Hellhound, Akistra' is activated, increasing ATK by 75% and Crit DMG by 75% for 10 sec. 'Hellhound, Akistra' is only activated once at 20 sec."
            ],
            "introduction": "It is unarguably the culmination of the latest imperial technomagi technology. It can transform into three modes, the last of which uses magic that is so devastating that its use has to be restricted. According to Valance, the head of the imperial weapons development organization Magos Le'Flamme, the new weapon Archistra was stolen, immediately after its development, by Crow, a former naval officer who was dishonorably discharged. It remains to be confirmed whether Crow really did manage to infiltrate one of the Empire's most important organizations to steal Archistra...it's also possible that Valance simply handed it over to him, given their long friendship."
        },
        "treasure": {
            "name": "Pendant of Memories",
            "description": [
                "[Even Gods shall Die] Gains immunity to CC during skill activation and DMG is increased by 20%.",
                "[Even Gods shall Die] Gains immunity to CC during skill activation and DMG is increased by 24%.",
                "[Even Gods shall Die] Gains immunity to CC during skill activation and DMG is increased by 29%.",
                "[Even Gods shall Die] Gains immunity to CC during skill activation and DMG is increased by 35%.",
                "[Even Gods shall Die] Gains immunity to CC during skill activation and DMG is increased by 42%.",
                "[Even Gods shall Die] Gains immunity to CC during skill activation and DMG is increased by 50%."
            ],
            "introduction": "A precious pendant containing the memories of Crow's deceased wife and daughter. He frequently stares at the picture while sucking on candy, looking extremely sad yet calm. It's a pendant even more precious than his life, so you better not lay a finger on it. Even if you are a god, you will have to pay with your life."
        },
        "treasure-2": {
            "name": "Cold Barrage",
            "description": [
                "[Struggle is Meaningless] Reduces Mana Cost by 1 and has a 10% chance to freeze target for 3 sec upon every strike.",
                "[Struggle is Meaningless] Reduces Mana Cost by 1 and has a 12% chance to freeze target for 3 sec upon every strike.",
                "[Struggle is Meaningless] Reduces Mana Cost by 1 and has a 14% chance to freeze target for 3 sec upon every strike.",
                "[Struggle is Meaningless] Reduces Mana Cost by 1 and has a 17% chance to freeze target for 3 sec upon every strike.",
                "[Struggle is Meaningless] Reduces Mana Cost by 1 and has a 21% chance to freeze target for 3 sec upon every strike.",
                "[Struggle is Meaningless] Reduces Mana Cost by 1 and has a 25% chance to freeze target for 3 sec upon every strike."
            ],
            "introduction": "Magos Le'Flamme, the imperial weapons development organization, succeeded in enhancing the Ground Chill Missile. They tried to equip it on the new weapon Akistra to test it out. However, Crow stole Akistra, so the missile that was equipped on it was stolen as well. This missile contains a powerful chill, and it's enough to freeze the surrounding land."
        },
        "hasProfile": false
    },
    {
        "name": "Ezekiel",
        "class": "Assassin",
        "weapon": {
            "name": "Jailer of Despair Barbatos",
            "description": [
                "Fury duration is increased by 2 sec and when in Fury state, Crit DMG is increased by 80%.",
                "Fury duration is increased by 3 sec and when in Fury state, Crit DMG is increased by 90%.",
                "Fury duration is increased by 4 sec and when in Fury state, Crit DMG is increased by 100%.",
                "Fury duration is increased by 5 sec and when in Fury state, Crit DMG is increased by 110%.",
                "Fury duration is increased by 6 sec and when in Fury state, Crit DMG is increased by 120%.",
                "Fury duration is increased by 7 sec and when in Fury state, Crit DMG is increased by 130%."
            ],
            "introduction": "Ezekiel's father was one of the highest-ranking Demons. Although he does not know his father's name or face, he is aware of the tremendous power of the Demon blood he inherited. The Demon blood flowing within his veins also gave him a second personality. When his human blood prevails, Ezekiel is a young man of excellent character. At other times, he is an immensely powerful and arrogant Demon, just like his father, Barbatos, jailer of Despair, manifests itself when Ezekiel's Demon blood is in full power. Taking the form of one of his arms, this weapon is powerful enough to slash through dimensions and sever the space itself. It is the physical representation of his father's power."
        },
        "treasure": {
            "name": "Sealing Binds",
            "description": [
                "[Strike of Doom] DMG is increased by 20% and gains 1 additional stack of Cursed Blood after using the skill.",
                "[Strike of Doom] DMG is increased by 24% and gains 1 additional stack of Cursed Blood after using the skill.",
                "[Strike of Doom] DMG is increased by 29% and gains 1 additional stack of Cursed Blood after using the skill.",
                "[Strike of Doom] DMG is increased by 35% and gains 1 additional stack of Cursed Blood after using the skill.",
                "[Strike of Doom] DMG is increased by 42% and gains 1 additional stack of Cursed Blood after using the skill.",
                "[Strike of Doom] DMG is increased by 50% and gains 1 additional stack of Cursed Blood after using the skill."
            ],
            "introduction": "A bond containing the mana of unknown priest. Young Ezekiel used to go berserk frequently. If anyone insulted his mom, he would allow his boiling demon blood to take over. Once he return to his sense, he would stare at this wounded arms and his terrified mom. When he was getting older, Ezekiel was getting rid of demons when he got into an argument with a bigger priest of Lua. He went berserk, just like any other day. Ezekiel was alone when he came to, and he was taken aback by the bond on his cursed arm. When he tried to take it off, he found the priest's magic couldn't be shaken off so easily. However, he stopped going berserk and losing his consciousness after that. He's gained greater control over his mana, so it's now one of his most treasured items."
        },
        "treasure-2": {
            "name": "Wild Beast's Choker",
            "description": [
                "[Dawning Despair] Gains Immunity to CC for the skill's duration and increases ATK Spd by 100 for 10 sec.",
                "[Dawning Despair] Gains Immunity to CC for the skill's duration and increases ATK Spd by 120 for 10 sec.",
                "[Dawning Despair] Gains Immunity to CC for the skill's duration and increases ATK Spd by 140 for 10 sec.",
                "[Dawning Despair] Gains Immunity to CC for the skill's duration and increases ATK Spd by 170 for 10 sec.",
                "[Dawning Despair] Gains Immunity to CC for the skill's duration and increases ATK Spd by 210 for 10 sec.",
                "[Dawning Despair] Gains Immunity to CC for the skill's duration and increases ATK Spd by 250 for 10 sec."
            ],
            "introduction": "Choker made with the skin of a powerful beast. Loot that celebrates the manticore that Ezekiel hunted after a hard battle against the Demons when he was young.<br>Ezekiel remembers the joy of killing the manticore every time he touches the violent beast's choker, just before he charges at the formidable enemy in front of him."
        },
        "hasProfile": false
    },
    {
        "name": "Ophelia",
        "class": "Wizard",
        "weapon": {
            "name": "Cards of Destiny Del Arcana",
            "description": [
                "Upon attack, there is a 77.7% chance that for 7 sec, ATK Spd is increased by 20, and mana recovery per sec is increased by 10%. This effect can be stacked max 15 times.",
                "Upon attack, there is a 77.7% chance that for 7 sec, ATK Spd is increased by 24, and mana recovery per sec is increased by 12%. This effect can be stacked max 15 times.",
                "Upon attack, there is a 77.7% chance that for 7 sec, ATK Spd is increased by 29, and mana recovery per sec is increased by 14%. This effect can be stacked max 15 times.",
                "Upon attack, there is a 77.7% chance that for 7 sec, ATK Spd is increased by 35, and mana recovery per sec is increased by 17%. This effect can be stacked max 15 times.",
                "Upon attack, there is a 77.7% chance that for 7 sec, ATK Spd is increased by 42, and mana recovery per sec is increased by 21%. This effect can be stacked max 15 times.",
                "Upon attack, there is a 77.7% chance that for 7 sec, ATK Spd is increased by 50, and mana recovery per sec is increased by 25%. This effect can be stacked max 15 times."
            ],
            "introduction": "Tarot card reading is a common fortune telling method for witches. Some witches use customized cards to suit their personal styles. Ophelia's cards also function as the proof of the pacts between her and the creatures she summons. Quite popular as a guide of destiny among the entities of the mysterious dimensions, she has made pacts with countless creatures. Del Arcana, a powerful tarot deck carefully assembled by Ophelia, is the physical proof of these relationships."
        },
        "treasure": {
            "name": "Coin of Fortune",
            "description": [
                "[Card of Fortune - Vellekia] Mana cost is reduced by 1 and DMG is increased by 20%.",
                "[Card of Fortune - Vellekia] Mana cost is reduced by 1 and DMG is increased by 24%.",
                "[Card of Fortune - Vellekia] Mana cost is reduced by 1 and DMG is increased by 29%.",
                "[Card of Fortune - Vellekia] Mana cost is reduced by 1 and DMG is increased by 35%.",
                "[Card of Fortune - Vellekia] Mana cost is reduced by 1 and DMG is increased by 42%.",
                "[Card of Fortune - Vellekia] Mana cost is reduced by 1 and DMG is increased by 50%."
            ],
            "introduction": "The legendary coin that it is said to have changed the curse of the wheel of fortune, which was headed towards destruction. Ophelia believes that it was thrown by the spirit of luck, Vellekia."
        },
        "treasure-2": {
            "name": "Elliciad's Heart",
            "description": [
                "[Card of Love - Elliciad] Dispels Negative Effects of the target and all skill cooldown are decreased by 6%.",
                "[Card of Love - Elliciad] Dispels Negative Effects of the target and all skill cooldown are decreased by 7.2%.",
                "[Card of Love - Elliciad] Dispels Negative Effects of the target and all skill cooldown are decreased by 8.6%.",
                "[Card of Love - Elliciad] Dispels Negative Effects of the target and all skill cooldown are decreased by 10.4%.",
                "[Card of Love - Elliciad] Dispels Negative Effects of the target and all skill cooldown are decreased by 12.5%.",
                "[Card of Love - Elliciad] Dispels Negative Effects of the target and all skill cooldown are decreased by 15%."
            ],
            "introduction": "Spirit of love, Elliciad's heart.<br>It eats both fulfilled and unfulfilled loves, so it can sometimes be as hot as lava, or as cold as ice. The power it displays depends on how contaminated a soul is, and it can display an extensive light of blessing to those with pure souls."
        },
        "hasProfile": false
    },
    {
        "name": "Requina",
        "class": "Archer",
        "weapon": {
            "name": "The Flute of Silent Winds Rakshathar",
            "description": [
                "Max stack of Tickle Tickle Potion is increased to 55. Each auto attack has a 10% chance of attacking a random enemy, dealing 20% of ATK as DMG and inflicting Silence for 1 sec.",
                "Max stack of Tickle Tickle Potion is increased to 60. Each auto attack has a 10% chance of attacking a random enemy, dealing 24% of ATK as DMG and inflicting Silence for 1 sec.",
                "Max stack of Tickle Tickle Potion is increased to 65. Each auto attack has a 10% chance of attacking a random enemy, dealing 29% of ATK as DMG and inflicting Silence for 1 sec.",
                "Max stack of Tickle Tickle Potion is increased to 70. Each auto attack has a 10% chance of attacking a random enemy, dealing 35% of ATK as DMG and inflicting Silence for 1 sec.",
                "Max stack of Tickle Tickle Potion is increased to 75. Each auto attack has a 10% chance of attacking a random enemy, dealing 42% of ATK as DMG and inflicting Silence for 1 sec.",
                "Max stack of Tickle Tickle Potion is increased to 80. Each auto attack has a 10% chance of attacking a random enemy, dealing 50% of ATK as DMG and inflicting Silence for 1 sec."
            ],
            "introduction": "A hyper-accurate blowgun made by Requina herself. A special muting piece added at the end makes this already-quiet weapon almost completely silent. As the appearance of Demons began to hurt her business, she decided to utilize anything she could, not just poisons. She sought help from her elementalist friend, who imbued the blowgun with the wind's blessing. This gave the weapon firepower equal to that of a magic cannon. After adding Requina's ultra-deadly =, Demon-slaying poison to it, it became a powerful and deadly weapon capable of killing any living being."
        },
        "treasure": {
            "name": "Sparkling Potion",
            "description": [
                "[More! Stronger!] Attacks additional 1 target and ATK Spd is increased by 100 for the duration.",
                "[More! Stronger!] Attacks additional 1 target and ATK Spd is increased by 120 for the duration.",
                "[More! Stronger!] Attacks additional 1 target and ATK Spd is increased by 140 for the duration.",
                "[More! Stronger!] Attacks additional 1 target and ATK Spd is increased by 170 for the duration.",
                "[More! Stronger!] Attacks additional 1 target and ATK Spd is increased by 210 for the duration.",
                "[More! Stronger!] Attacks additional 1 target and ATK Spd is increased by 250 for the duration."
            ],
            "introduction": "Medicine made from boiling the powder of the seventieth rainbow and the tongue of the giant beast Kiselaton who can cross hell. It is full of brilliant colors. The moment one drinks it, it burns the insides, but it is said that whoever drinks it slowly dies in happiness."
        },
        "treasure-2": {
            "name": "Basilisk's Poisonous Fang",
            "description": [
                "[Screechy Grass Extract!] Skill cooldown is decreased by 30% and deals 3% of ATK as additional P.DMG per each stacked Tickle Tickle Potion! of target.",
                "[Screechy Grass Extract!] Skill cooldown is decreased by 30% and deals 3.6% of ATK as additional P.DMG per each stacked Tickle Tickle Potion! of target.",
                "[Screechy Grass Extract!] Skill cooldown is decreased by 30% and deals 4.3% of ATK as additional P.DMG per each stacked Tickle Tickle Potion! of target.",
                "[Screechy Grass Extract!] Skill cooldown is decreased by 30% and deals 5.2% of ATK as additional P.DMG per each stacked Tickle Tickle Potion! of target.",
                "[Screechy Grass Extract!] Skill cooldown is decreased by 30% and deals 6.2% of ATK as additional P.DMG per each stacked Tickle Tickle Potion! of target.",
                "[Screechy Grass Extract!] Skill cooldown is decreased by 30% and deals 7.5% of ATK as additional P.DMG per each stacked Tickle Tickle Potion! of target."
            ],
            "introduction": "A nasty fang of Basilisk that only absorbs evil energy. Its poison is actually strong enough to melt souls. If the poison from the fang is mixed up with screechy grass, it could become a tremendous drug that no organism could survice. Requina's heart is beating hard with anticipation."
        },
        "hasProfile": false
    },
    {
        "name": "Shea",
        "class": "Priest",
        "weapon": {
            "name": "Charming Melody , Schwanheite",
            "description": [
                "When Trance is stacked, all skill cooldown is reduced by 10%, and recovers own Mana by 200.",
                "When Trance is stacked, all skill cooldown is reduced by 12%, and recovers own Mana by 240.",
                "When Trance is stacked, all skill cooldown is reduced by 14%, and recovers own Mana by 290.",
                "When Trance is stacked, all skill cooldown is reduced by 17%, and recovers own Mana by 350.",
                "When Trance is stacked, all skill cooldown is reduced by 20%, and recovers own Mana by 420.",
                "When Trance is stacked, all skill cooldown is reduced by 25%, and recovers own Mana by 500."
            ],
            "introduction": "This powerful and awe-inspiring equipment that can converse with their wielders, sometimes even dominating the owners themselves. Schwanheite is counted among these awesome weapons. This harp, which insists that it be called 'Mr. Schute' can significantly amplify the wielder's mana and spray it all around the wielder. Since the amplified mana is scattered about, it cannot be effectively used as offensive magic. However, depending on how it's used it can prove to be extremely effective in other ways. Mr. Schute is quite a chatterbox, but only to those he considers as his friends. These days he only talks to Shea."
        },
        "treasure": {
            "name": "Fairy's Crown",
            "description": [
                "[Dance of Red Passion] Upon activation, enemies are inflicted with Silence for 2 sec, and all allies' Crit DMG is increased by 20% for the duration of skill.",
                "[Dance of Red Passion] Upon activation, enemies are inflicted with Silence for 2 sec, and all allies' Crit DMG is increased by 24% for the duration of skill.",
                "[Dance of Red Passion] Upon activation, enemies are inflicted with Silence for 2 sec, and all allies' Crit DMG is increased by 29% for the duration of skill.",
                "[Dance of Red Passion] Upon activation, enemies are inflicted with Silence for 2 sec, and all allies' Crit DMG is increased by 35% for the duration of skill.",
                "[Dance of Red Passion] Upon activation, enemies are inflicted with Silence for 2 sec, and all allies' Crit DMG is increased by 42% for the duration of skill.",
                "[Dance of Red Passion] Upon activation, enemies are inflicted with Silence for 2 sec, and all allies' Crit DMG is increased by 50% for the duration of skill."
            ],
            "introduction": "A chaplet that was by Shea's head the day after she performed Lullaby to the Dreams in the forest. According to Schwanheite, it was a gift from the fairies of the forest for her beautiful music. It is said that items that went through the hands of fairies have the power to return a soul back to its purest form."
        },
        "treasure-2": {
            "name": "Windy Flower",
            "description": [
                "[Blue Wind's Song] Increases ACC by 250 for 8 sec and recovers 160 MP every time an ally uses a skill.",
                "[Blue Wind's Song] Increases ACC by 250 for 8 sec and recovers 190 MP every time an ally uses a skill.",
                "[Blue Wind's Song] Increases ACC by 250 for 8 sec and recovers 230 MP every time an ally uses a skill.",
                "[Blue Wind's Song] Increases ACC by 250 for 8 sec and recovers 270 MP every time an ally uses a skill.",
                "[Blue Wind's Song] Increases ACC by 250 for 8 sec and recovers 330 MP every time an ally uses a skill.",
                "[Blue Wind's Song] Increases ACC by 250 for 8 sec and recovers 400 MP every time an ally uses a skill."
            ],
            "introduction": "A flower that was by Shea's head the day after she performed Happiness from the Wind. According to Schwanheit, it was also a gift from the fairies of the forest for her beautiful music. It contains Shea's wish that the wind will carry happiness all over the world."
        },
        "hasProfile": false
    },
    {
        "name": "Chase",
        "class": "Warrior",
        "weapon": {
            "name": "Blood Lancer Monolith",
            "description": [
                "Increases own Crit DMG by 20%. Upon auto attack, deals P.DMG equal to 30% of ATK with [Flame of Monolith] and recovers HP equal to 20% of DMG dealt. When [Remove Limit] is active, the effect of [Flame of Monolith] is doubled.",
                "Increases own Crit DMG by 24%. Upon auto attack, deals P.DMG equal to 36% of ATK with [Flame of Monolith] and recovers HP equal to 20% of DMG dealt. When [Remove Limit] is active, the effect of [Flame of Monolith] is doubled.",
                "Increases own Crit DMG by 28%. Upon auto attack, deals P.DMG equal to 43% of ATK with [Flame of Monolith] and recovers HP equal to 20% of DMG dealt. When [Remove Limit] is active, the effect of [Flame of Monolith] is doubled.",
                "Increases own Crit DMG by 34%. Upon auto attack, deals P.DMG equal to 52% of ATK with [Flame of Monolith] and recovers HP equal to 20% of DMG dealt. When [Remove Limit] is active, the effect of [Flame of Monolith] is doubled.",
                "Increases own Crit DMG by 42%. Upon auto attack, deals P.DMG equal to 62% of ATK with [Flame of Monolith] and recovers HP equal to 20% of DMG dealt. When [Remove Limit] is active, the effect of [Flame of Monolith] is doubled.",
                "Increases own Crit DMG by 50%. Upon auto attack, deals P.DMG equal to 75% of ATK with [Flame of Monolith] and recovers HP equal to 20% of DMG dealt. When [Remove Limit] is active, the effect of [Flame of Monolith] is doubled."
            ],
            "introduction": "A weapon for Enhanced Human Type.0 that was made after thousands of attempts in one of the laboratories of the empire. Enhanced Human Type.0 destroyed everything as soon as he woke up from the laboratory in order to find a weapon that could withstand his power. In the end, he tore out the horn of the monster Cannibal, which was known to have swallowed Arrogance out of the 7 sins. This horn went through the hands of the greatest blacksmiths of the empire and became the Blood Lancer Monolith. The flame of sin is burning inside the weapon, and whatever it pierces cannot be healed. The feeling of striking with this weapon pleasurable enough to make him forget about the lingering attachment to his lost memory."
        },
        "treasure": {
            "name": "Unrelenting Pauldron",
            "description": [
                "[Burn, Spear of Fury] Reduces Mana Cost by 1 and increases DMG by 20%.",
                "[Burn, Spear of Fury] Reduces Mana Cost by 1 and increases DMG by 24%.",
                "[Burn, Spear of Fury] Reduces Mana Cost by 1 and increases DMG by 29%.",
                "[Burn, Spear of Fury] Reduces Mana Cost by 1 and increases DMG by 35%.",
                "[Burn, Spear of Fury] Reduces Mana Cost by 1 and increases DMG by 42%.",
                "[Burn, Spear of Fury] Reduces Mana Cost by 1 and increases DMG by 50%."
            ],
            "introduction": "Pauldron that Chase wears on one shoulder. It is made up of special ores that are hard to find in the Orbis Continent. It's light but extremely sturdy and unbreakable. An item that Demia managed to get for Chase, since Scarlet was fond of him. Demia didn't show it much, but she was intrigued by how Chase normally seemed so naive, and yet was enthusiastic when it came to sparring. Demia watched him for a few days, and one day, patting his shoulder, she nonchalantly gave Chase the pauldron. She told him that fighting was important, but it was also important to take care of his own body."
        },
        "treasure-2": {
            "name": "Handkerchief of Loyalty",
            "description": [
                "[Remove Limit] For the skill's duration, deals P.DMG by 40% ATK every second to nearby enemies and increases Recovery by 30%.",
                "[Remove Limit] For the skill's duration, deals P.DMG by 48% ATK every second to nearby enemies and increases Recovery by 30%.",
                "[Remove Limit] For the skill's duration, deals P.DMG by 58% ATK every second to nearby enemies and increases Recovery by 30%.",
                "[Remove Limit] For the skill's duration, deals P.DMG by 70% ATK every second to nearby enemies and increases Recovery by 30%.",
                "[Remove Limit] For the skill's duration, deals P.DMG by 84% ATK every second to nearby enemies and increases Recovery by 30%.",
                "[Remove Limit] For the skill's duration, deals P.DMG by 100% ATK every second to nearby enemies and increases Recovery by 30%."
            ],
            "introduction": "An item given to Chase by Scarlet. She gave it to him because she felt sorry for him for not having a name.<br>Chase's name is embroidered in one corner of the handkerchief.<br>It doesn't really match his look, but he carries it all the time.<br>Chase lost his memory and could only figure out who he was by the test subject code marked on his waist. The moment when someone called him by a name was when he finally found a goal in life.<br>He decided to use his overflowing power to protect those who made him feel alive."
        },
        "hasProfile": false
    },
    {
        "name": "Kara",
        "class": "Mechanic",
        "weapon": {
            "name": "0-Form Perpetual Motion Cannon, Heaven Shatterer",
            "description": [
                "Increases ATK by 1% every second. Can be stacked up to 30 times.",
                "Increases ATK by 1% every second. Can be stacked up to 40 times.",
                "Increases ATK by 1% every second. Can be stacked up to 50 times.",
                "Increases ATK by 1% every second. Can be stacked up to 60 times.",
                "Increases ATK by 1% every second. Can be stacked up to 70 times.",
                "Increases ATK by 1% every second. Can be stacked up to 80 times."
            ],
            "introduction": "An artifact from an ancient civilization that has been an engine that provides unlimited power. It's a mighty weapon with the power of a siege weapon, and its power comes close to that of the highest-rank magic. This weapon was found in the ruins of the old Republic of Grey, but it remained in storage since no one knew how to use it. Long after that, Kara was excavated and once she awakened, it teleported to her side. The highest-ranking technomagic weapon that was made in a similar way as the Mountain Fortres"
        },
        "treasure": {
            "name": "Ancient Power Source",
            "description": [
                "[Release Siege Weapon] Increases DMG by 50% and decreases the target's M.DEF by 1% upon a Crit Hit. M.DEF Reduction Effect can be stacked up to 20 times.",
                "[Release Siege Weapon] Increases DMG by 50% and decreases the target's M.DEF by 1% upon a Crit Hit. M.DEF Reduction Effect can be stacked up to 24 times.",
                "[Release Siege Weapon] Increases DMG by 50% and decreases the target's M.DEF by 1% upon a Crit Hit. M.DEF Reduction Effect can be stacked up to 29 times.",
                "[Release Siege Weapon] Increases DMG by 50% and decreases the target's M.DEF by 1% upon a Crit Hit. M.DEF Reduction Effect can be stacked up to 35 times.",
                "[Release Siege Weapon] Increases DMG by 50% and decreases the target's M.DEF by 1% upon a Crit Hit. M.DEF Reduction Effect can be stacked up to 42 times.",
                "[Release Siege Weapon] Increases DMG by 50% and decreases the target's M.DEF by 1% upon a Crit Hit. M.DEF Reduction Effect can be stacked up to 50 times."
            ],
            "introduction": "Kara's source of power and one of the greatest masterpieces of an ancient civilization that has been long forgotten. It's the basic technology that Annette used to make the Rascal, but not even she has been able to figure out everything about this special technology. A permanent engine that continuously creates unlimited magic power."
        },
        "treasure-2": {
            "name": "Recording Device KARA-00XX",
            "description": [
                "[Wide-area Cannon] Increases DMG by 50% and reduces ATK Spd of the target by 100 for 10 sec.<br><br>[Focused Fire] Reduces Cooldown by 2% upon a Crit Hit and recovers 150 Mana.",
                "[Wide-area Cannon] Increases DMG by 50% and reduces ATK Spd of the target by 120 for 10 sec.<br><br>[Focused Fire] Reduces Cooldown by 2.4% upon a Crit Hit and recovers 150 Mana.",
                "[Wide-area Cannon] Increases DMG by 50% and reduces ATK Spd of the target by 140 for 10 sec.<br><br>[Focused Fire] Reduces Cooldown by 2.9% upon a Crit Hit and recovers 150 Mana.",
                "[Wide-area Cannon] Increases DMG by 50% and reduces ATK Spd of the target by 170 for 10 sec.<br><br>[Focused Fire] Reduces Cooldown by 3.5% upon a Crit Hit and recovers 150 Mana.",
                "[Wide-area Cannon] Increases DMG by 50% and reduces ATK Spd of the target by 210 for 10 sec.<br><br>[Focused Fire] Reduces Cooldown by 4.2% upon a Crit Hit and recovers 150 Mana.",
                "[Wide-area Cannon] Increases DMG by 50% and reduces ATK Spd of the target by 250 for 10 sec.<br><br>[Focused Fire] Reduces Cooldown by 5% upon a Crit Hit and recovers 150 Mana."
            ],
            "introduction": "A recording device and processor that works as Kara's brain.<br>It's treasure that is filled with ancient wisdom, and its capacity far surpasses that of humans. Despite being such an incredible device, it has a hard time recording and replicating emotions."
        },
        "hasProfile": false,
        "hasLinkedSkill": true
    },
    {
        "name": "Shamilla",
        "class": "Archer",
        "weapon": {
            "name": "Wings of Corruption, Apoliox",
            "description": [
                "Every 20 seconds, obtains The Vessel of Curses and increases ATK by 20% for 10 seconds.",
                "Every 19 seconds, obtains The Vessel of Curses and increases ATK by 24% for 10 seconds.",
                "Every 18 seconds, obtains The Vessel of Curses and increases ATK by 29% for 10 seconds.",
                "Every 17 seconds, obtains The Vessel of Curses and increases ATK by 35% for 10 seconds.",
                "Every 16 seconds, obtains The Vessel of Curses and increases ATK by 42% for 10 seconds.",
                "Every 15 seconds, obtains The Vessel of Curses and increases ATK by 50% for 10 seconds."
            ],
            "introduction": "Curses are born from negative feelings such as hatred, jealousy, and resentment. These are the best food for Shamilla. The wings that grew powerful during the Demon War by absorbing the curses of countless people are terrifying to normal people. Those who are touched by the feathers are said to be bound by many curses, and they fall into a vortex of emotions. In that abyss, a captivating and seductive laughter echoes. The laughter of a demon that enjoys the different kinds of human feelings."
        },
        "treasure": {
            "name": "The Jar of Curses",
            "description": [
                "[Curse of Pain] DMG is increased by 20%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
                "[Curse of Pain] DMG is increased by 24%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
                "[Curse of Pain] DMG is increased by 29%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
                "[Curse of Pain] DMG is increased by 35%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
                "[Curse of Pain] DMG is increased by 42%, and gains a stack of 'The Vessel of Curses' upon killing an enemy.",
                "[Curse of Pain] DMG is increased by 50%, and gains a stack of 'The Vessel of Curses' upon killing an enemy."
            ],
            "introduction": "Shamilla has been cursed to hold all the curses in the world inside her, but could also be seen as a savior who binds all those curses. Her death would mean that all evil she holds within would go back out into the world. This jar of Curses that Shamilla made is used to retrieve curses that Shamilla spat out."
        },
        "treasure-2": {
            "name": "Ancient Demon's Heart",
            "description": [
                "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 10% for 10 sec.",
                "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 12% for 10 sec.",
                "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 14% for 10 sec.",
                "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 17% for 10 sec.",
                "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 21% for 10 sec.",
                "[Curse of Time] Additionally increases Cooldown by 0.7 sec and reduces M.DEF of the target by 25% for 10 sec."
            ],
            "introduction": "A strange jewel from which the resentful whispers of ancient demons can be heard.<br>A cursed item filled with the souls of long forgotten ancient demons.<br>They wish to escape every day, but she won't let them out that easily.<br>Her soul has accepted all the curses of the world, so it is as deep and dark as the abyss."
        },
        "hasProfile": false
    },
    {
        "name": "Veronica",
        "class": "Wizard",
        "weapon": {
            "name": "Infinite Charter, Accordio",
            "description": [
                "All DMG from skills inflicts an additional M.DMG by 50% of ATK. Additionally, the Top Financier's Knowledge max stack increases to 9.",
                "All DMG from skills inflicts an additional M.DMG by 60% of ATK. Additionally, the Top Financier's Knowledge max stack increases to 10.",
                "All DMG from skills inflicts an additional M.DMG by 70% of ATK. Additionally, the Top Financier's Knowledge max stack increases to 11.",
                "All DMG from skills inflicts an additional M.DMG by 85% of ATK. Additionally, the Top Financier's Knowledge max stack increases to 12.",
                "All DMG from skills inflicts an additional M.DMG by 100% of ATK. Additionally, the Top Financier's Knowledge max stack increases to 13.",
                "All DMG from skills inflicts an additional M.DMG by 125% of ATK. Additionally, the Top Financier's Knowledge max stack increases to 15."
            ],
            "introduction": "Her approval is needed to process any important items in the Guild Alliance. An office item cherished by the founder of the Guild Alliance. A feather pen and folder put together in a set. The pen has a mana ball embedded in it so it requires mana instead of ink, and it must be used on a magic parchment that cannot be written on with a regular pen. The letters that are written by the writer cannot be erased without the writer's mana. Also, text can be written on the magic parchment without any limit, and it has a function to search for stuff one has written before. It makes Veronica's work that much more effective. Of course, it's useful when it's used for work, but outside of work..."
        },
        "treasure": {
            "name": "Seal of Guild Manager",
            "description": [
                "[Get out of my sight!] DMG is increased by 20% and per each enemy hit, cooldown is reduced by 10%.",
                "[Get out of my sight!] DMG is increased by 24% and per each enemy hit, cooldown is reduced by 10%.",
                "[Get out of my sight!] DMG is increased by 29% and per each enemy hit, cooldown is reduced by 10%.",
                "[Get out of my sight!] DMG is increased by 35% and per each enemy hit, cooldown is reduced by 10%.",
                "[Get out of my sight!] DMG is increased by 42% and per each enemy hit, cooldown is reduced by 10%.",
                "[Get out of my sight!] DMG is increased by 50% and per each enemy hit, cooldown is reduced by 10%."
            ],
            "introduction": "A seal given to the best guild manager of Orvel. All guild affairs can't be processed without this seal. The meticulous Veronica doesn't stamp a document unless it's perfect. An item that shows Veronica's professional spirit."
        },
        "treasure-2": {
            "name": "Pen Point of Firm Will",
            "description": [
                "[Let Me Help You] Reduces Mana Cost by 1 and increases skill duration by 1.6 sec.",
                "[Let Me Help You] Reduces Mana Cost by 1 and increases skill duration by 1.9 sec.",
                "[Let Me Help You] Reduces Mana Cost by 1 and increases skill duration by 2.3 sec.",
                "[Let Me Help You] Reduces Mana Cost by 1 and increases skill duration by 2.7 sec.",
                "[Let Me Help You] Reduces Mana Cost by 1 and increases skill duration by 3.3 sec.",
                "[Let Me Help You] Reduces Mana Cost by 1 and increases skill duration by 4 sec."
            ],
            "introduction": "Pen point that Veronica always carries around. She had soaked it in the Spring of Promise for 100 days, just like Blacksmith Jin had advised. With the power of magic, the letters written by this pen turn red when the actions are not carried out accordingly. Veronica says it's very helpful when managing supplies."
        },
        "hasProfile": false
    },
    {
        "name": "Loman",
        "class": "Knight",
        "weapon": {
            "name": "Wave of Protection, Gaiamenes",
            "description": [
                "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing 200% of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by 25% for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by 10% for 10 seconds. While 'Blessing of Orvelia' lasts, 'Pride of Orvelia' does not stack.",
                "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing 240% of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by 30% for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by 12% for 10 seconds. While 'Blessing of Orvelia' lasts, 'Pride of Orvelia' does not stack.",
                "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing 290% of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by 36% for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by 14% for 10 seconds. While 'Blessing of Orvelia' lasts, 'Pride of Orvelia' does not stack.",
                "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing 350% of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by 43% for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by 17% for 10 seconds. While 'Blessing of Orvelia' lasts, 'Pride of Orvelia' does not stack.",
                "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing 420% of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by 51% for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by 21% for 10 seconds. While 'Blessing of Orvelia' lasts, 'Pride of Orvelia' does not stack.",
                "Pride of Orvelia' is stacked on every use of skills. 'Pride of Orvelia' cannot be dispelled, and when stacked 3 times, 'Blessing of Orvelia' is activated, dealing 500% of ATK as P.DMG to enemies within a wide range and increasing P.Weakness of the targets by 60% for 20 seconds. 'Blessing of Orvelia' also increases M.DEF by 25% for 10 seconds. While 'Blessing of Orvelia' lasts, 'Pride of Orvelia' does not stack."
            ],
            "introduction": "The halberd held by an ancient guardian statue defending the gate of the labyrinth that was recently discovered at the Royal Underground. The old, eroded statue was holding the halberd firmly in its hands, as if showing its determination to protect the labyrinth against intruders. Loman, who was in charge of the labyrinth excavation, felt something indescribably sublime from the statue and showed due courtesy in front of it. At that moment, the statue dropped its halberd to the ground and began to crumble away. The halberd itself seemed unaffected by the time and was imbued with a mysterious energy.<br>'That statue suddenly crumbled and dropped the halberd...'<br>Scarlet said, glancing over the report.<br>'Yes, ma'am.'<br>Scarlet then gazed at Loman.<br>'The unyielding sincerity of protecting a place until his very body collapse... I know a man like that.'<br>'Pardon, ma'am?'<br>He looked at Scarlet with a puzzled face as she handed over the halberd, smiling."
        },
        "treasure": {
            "name": "Sea of Invocation",
            "description": [
                "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by 10% for 10 seconds.",
                "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by 12% for 10 seconds.",
                "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by 14% for 10 seconds.",
                "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by 17% for 10 seconds.",
                "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by 21% for 10 seconds.",
                "[Knight's Creed] Reduces Cooldown by 30%, and increases P.Weakness of the target by 25% for 10 seconds."
            ],
            "introduction": "An heirloom of Loman's family, this special pendant is bestowed by the first King of Orvelia to Loman's family in honor of their service and loyalty to protect the Orvel Monarchy. Its true origin is unknown, but it is believed to be an accessory that has the spirit of the Guardian of Orbis Continent from an ancient civilization. The owners of this item have said the same thing. When they resolve to stake their lives to defend what is important to them, they invoke a mighty power like the waves of the sea. People now believe this blue gem invokes spirits, and it started to be called the Sea of Invocation. Loman received it as an heirloom from his father when he entered the castle, and he always keeps it with him."
        },
        "treasure-2": {
            "name": "Wooden Doll Miniature",
            "description": [
                "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by 400.",
                "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by 480.",
                "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by 580.",
                "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by 700.",
                "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by 840.",
                "[Shrouding Creed] Reduces Mana Cost by 1 and recovers target's Mana by 1000."
            ],
            "introduction": "Loman used to carve small sculptures as big as his hand while his thoughts in order when things went wrong. As he smoothed out their edges, he'd feel at peace and recall his resolve when he was just learning the basics. It was just a pastime at first, but soon it became his hobby, and he filled his room with hundreds of sculptures. And one day, Loman started to make wooden dolls to give to his friends and his men. Back then, sorcerous dolls known to protect hearts from evil were popular in Orvelia. Loman asked an old shaman who practiced ancient folk remedies to enchant the wooden dolls with a spell of protection, and he gave them to his colleagues."
        },
        "hasProfile": false
    }
]